7767517
1327 1646
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Split                    splitncnn_0              1 2 in2 3 4
Input                    in3                      0 1 in3
Split                    splitncnn_1              1 4 in3 6 7 8 9
Input                    in4                      0 1 in4
Split                    splitncnn_2              1 3 in4 11 12 13
Input                    in5                      0 1 in5
Split                    splitncnn_3              1 2 in5 15 16
Input                    in6                      0 1 in6
Split                    splitncnn_4              1 2 in6 18 19
Input                    in7                      0 1 in7
Split                    splitncnn_5              1 4 in7 21 22 23 24
Input                    in8                      0 1 in8
Split                    splitncnn_6              1 3 in8 26 27 28
Input                    in9                      0 1 in9
Split                    splitncnn_7              1 2 in9 30 31
Input                    in10                     0 1 in10
Split                    splitncnn_8              1 2 in10 33 34
Input                    in11                     0 1 in11
Split                    splitncnn_9              1 4 in11 36 37 38 39
Input                    in12                     0 1 in12
Split                    splitncnn_10             1 3 in12 41 42 43
Input                    in13                     0 1 in13
Split                    splitncnn_11             1 2 in13 45 46
Input                    in14                     0 1 in14
Split                    splitncnn_12             1 2 in14 48 49
Input                    in15                     0 1 in15
Split                    splitncnn_13             1 4 in15 51 52 53 54
Input                    in16                     0 1 in16
Split                    splitncnn_14             1 3 in16 56 57 58
Input                    in17                     0 1 in17
Split                    splitncnn_15             1 2 in17 60 61
Input                    in18                     0 1 in18
Split                    splitncnn_16             1 2 in18 63 64
Input                    in19                     0 1 in19
Split                    splitncnn_17             1 4 in19 66 67 68 69
Input                    in20                     0 1 in20
Split                    splitncnn_18             1 3 in20 71 72 73
Input                    in21                     0 1 in21
Split                    splitncnn_19             1 2 in21 75 76
Input                    in22                     0 1 in22
Split                    splitncnn_20             1 2 in22 78 79
Input                    in23                     0 1 in23
Split                    splitncnn_21             1 4 in23 81 82 83 84
Input                    in24                     0 1 in24
Split                    splitncnn_22             1 3 in24 86 87 88
Input                    in25                     0 1 in25
Split                    splitncnn_23             1 2 in25 90 91
Input                    in26                     0 1 in26
Split                    splitncnn_24             1 2 in26 93 94
Input                    in27                     0 1 in27
Split                    splitncnn_25             1 4 in27 96 97 98 99
Input                    in28                     0 1 in28
Split                    splitncnn_26             1 3 in28 101 102 103
Input                    in29                     0 1 in29
Split                    splitncnn_27             1 2 in29 105 106
MemoryData               encoder.encoders.3.encoder.layers.1 0 1 107 0=1
MemoryData               encoder.encoders.3.encoder.layers.0 0 1 108 0=1
MemoryData               encoder.encoders.3.encoder.encoder_pos 0 1 109 0=384 1=11 2=1
MemoryData               encoder.encoders.2.encoder.layers.2 0 1 110 0=1
MemoryData               encoder.encoders.2.encoder.layers.1 0 1 111 0=1
MemoryData               encoder.encoders.2.encoder.layers.0 0 1 112 0=1
MemoryData               encoder.encoders.2.encoder.encoder_pos 0 1 113 0=384 1=23 2=1
MemoryData               encoder.encoders.1.encoder.layers.3 0 1 114 0=1
MemoryData               encoder.encoders.1.encoder.layers.2 0 1 115 0=1
MemoryData               encoder.encoders.1.encoder.layers.1 0 1 116 0=1
MemoryData               encoder.encoders.1.encoder.layers.0 0 1 117 0=1
MemoryData               encoder.encoders.1.encoder.encoder_pos 0 1 118 0=384 1=47 2=1
MemoryData               encoder.encoders.0.layers.1 0 1 119 0=1
MemoryData               encoder.encoders.0.layers.0 0 1 120 0=1
MemoryData               encoder.encoders.0.encoder_pos 0 1 121 0=384 1=95 2=1
ExpandDims               unsqueeze_470            1 1 in0 122 -23303=1,0
Convolution              conv_138                 1 1 122 123 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_28             1 2 123 124 125
BinaryOp                 sub_0                    1 1 124 126 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_22               1 1 126 127
BinaryOp                 mul_1                    2 1 125 127 128 0=2
Convolution              conv_139                 1 1 128 129 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_29             1 2 129 130 131
BinaryOp                 sub_2                    1 1 130 132 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_23               1 1 132 133
BinaryOp                 mul_3                    2 1 131 133 134 0=2
Convolution              conv_140                 1 1 134 135 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_30             1 2 135 136 137
BinaryOp                 sub_4                    1 1 136 138 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_24               1 1 138 139
BinaryOp                 mul_5                    2 1 137 139 140 0=2
BinaryOp                 sub_6                    1 1 in1 141 0=1 1=1 2=7.000000e+00
BinaryOp                 div_7                    1 1 141 142 0=3 1=1 2=2.000000e+00
UnaryOp                  floor_8                  1 1 142 out1 0=2
Crop                     crop_563                 1 1 79 144 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.0.state_select_list.0_ncnnreshape0 1 1 144 145 0=0 1=0
Crop                     crop_564                 1 1 94 146 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_11_ncnnreshape0 1 1 146 147 0=0 1=0
Permute                  permute_418              1 1 140 148 0=2
Reshape                  reshape_267              1 1 148 149 0=2432 1=-1
InnerProduct             linear_141               1 1 149 150 0=384 1=1 2=933888
Split                    splitncnn_31             1 4 150 151 152 153 154
InnerProduct             linear_142               1 1 154 155 0=1024 1=1 2=393216
Split                    splitncnn_32             1 2 155 156 157
BinaryOp                 sub_9                    1 1 156 158 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_25               1 1 158 159
BinaryOp                 mul_10                   2 1 157 159 160 0=2
InnerProduct             linear_143               1 1 160 161 0=384 1=1 2=393216
BinaryOp                 add_11                   2 1 151 161 162 0=0
Split                    splitncnn_33             1 2 162 163 164
Crop                     select_0                 1 1 19 165 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_1                 1 1 4 166 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_471 3 3 164 166 165 167 168 169
InnerProduct             linear_144               1 1 167 170 0=384 1=0 2=147456
BinaryOp                 add_12                   2 1 163 170 171 0=0
Split                    splitncnn_34             1 2 171 172 173
Crop                     select_2                 1 1 34 174 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_3                 1 1 49 175 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_145               1 1 173 176 0=512 1=1 2=196608
Slice                    tensor_split_0           1 4 176 177 178 179 180 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 175 179 181 0=0
Reshape                  reshape_268              1 1 181 182 0=12 1=8 2=80
Reshape                  reshape_269              1 1 177 183 0=24 1=8 2=16
Reshape                  reshape_270              1 1 180 184 0=4 1=8 2=16
Concat                   cat_1                    2 1 174 178 185 0=0
Reshape                  reshape_271              1 1 185 186 0=24 1=8 2=80
InnerProduct             linear_146               1 1 121 187 0=32 1=0 2=12288
Reshape                  reshape_272              1 1 187 188 0=4 1=8 2=95
Permute                  permute_486              1 1 188 189 0=3
Split                    splitncnn_35             1 2 189 190 191
Permute                  permute_484              1 1 184 192 0=2
MatMul                   matmul_385               2 1 192 191 193
Permute                  permute_485              1 1 186 194 0=3
Permute                  permute_483              1 1 183 195 0=2
MatMul                   matmul_386               2 1 195 194 196
TensorAsStrided          tensor_as_strided_585    1 1 193 197 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_13                   2 1 196 197 198 0=0
Reshape                  view_352                 1 1 198 199 0=80 1=16 2=8
Softmax                  softmax_80               1 1 199 200 0=-1 1=1
Split                    splitncnn_36             1 2 200 201 202
Permute                  permute_482              1 1 182 203 0=2
MatMul                   bmm_363                  2 1 202 203 204
Permute                  permute_487              1 1 204 205 0=2
Reshape                  reshape_273              1 1 205 206 0=96 1=16
InnerProduct             linear_147               1 1 206 207 0=384 1=1 2=36864
BinaryOp                 add_14                   2 1 172 207 208 0=0
Split                    splitncnn_37             1 2 208 209 210
Permute                  permute_420              1 1 210 211 0=1
Convolution1D            conv1d_94                1 1 211 212 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_0                    1 1 212 213 0=0
Concat                   cat_2                    2 1 145 213 214 0=1
ConvolutionDepthWise1D   convdw1d_602             1 1 214 215 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_38             1 2 215 216 217
BinaryOp                 sub_15                   1 1 216 218 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_26               1 1 218 219
BinaryOp                 mul_16                   2 1 217 219 220 0=2
Convolution1D            conv1d_95                1 1 220 221 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_421              1 1 221 222 0=1
BinaryOp                 add_17                   2 1 209 222 223 0=0
Split                    splitncnn_39             1 2 223 224 225
InnerProduct             linear_148               1 1 225 226 0=1024 1=1 2=393216
Split                    splitncnn_40             1 2 226 227 228
BinaryOp                 sub_18                   1 1 227 229 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_27               1 1 229 230
BinaryOp                 mul_19                   2 1 228 230 231 0=2
InnerProduct             linear_149               1 1 231 232 0=384 1=1 2=393216
BinaryOp                 add_20                   2 1 224 232 233 0=0
Split                    splitncnn_41             1 2 233 234 235
Crop                     select_4                 1 1 64 236 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_150               1 1 235 237 0=96 1=0 2=36864
Concat                   cat_3                    2 1 236 237 238 0=0
Reshape                  reshape_274              1 1 238 239 0=12 1=8 2=80
Permute                  permute_488              1 1 239 240 0=2
MatMul                   bmm_364                  2 1 201 240 241
Permute                  permute_489              1 1 241 242 0=2
Reshape                  reshape_275              1 1 242 243 0=96 1=16
InnerProduct             linear_151               1 1 243 244 0=384 1=1 2=36864
BinaryOp                 add_21                   2 1 234 244 245 0=0
Split                    splitncnn_42             1 2 245 246 247
Permute                  permute_422              1 1 247 248 0=1
Convolution1D            conv1d_96                1 1 248 249 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_1                    1 1 249 250 0=0
Concat                   cat_4                    2 1 147 250 251 0=1
ConvolutionDepthWise1D   convdw1d_603             1 1 251 252 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_43             1 2 252 253 254
BinaryOp                 sub_22                   1 1 253 255 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_28               1 1 255 256
BinaryOp                 mul_23                   2 1 254 256 257 0=2
Convolution1D            conv1d_97                1 1 257 258 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_423              1 1 258 259 0=1
BinaryOp                 add_24                   2 1 246 259 260 0=0
Split                    splitncnn_44             1 2 260 261 262
InnerProduct             linear_152               1 1 262 263 0=1024 1=1 2=393216
Split                    splitncnn_45             1 2 263 264 265
BinaryOp                 sub_25                   1 1 264 266 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_29               1 1 266 267
BinaryOp                 mul_26                   2 1 265 267 268 0=2
InnerProduct             linear_153               1 1 268 269 0=384 1=1 2=393216
BinaryOp                 add_27                   2 1 261 269 270 0=0
Split                    splitncnn_46             1 3 270 271 272 273
BinaryOp                 mul_28                   2 1 271 272 274 0=2
Reduction                mean_407                 1 1 274 275 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_29                   1 1 275 276 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_30                   1 1 276 277 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_31                   2 1 273 277 278 0=2
BinaryOp                 sub_32                   2 1 278 152 279 0=1
BinaryOp                 mul_33                   2 1 279 120 280 0=2
BinaryOp                 add_34                   2 1 153 280 281 0=0
Split                    splitncnn_47             1 4 281 282 283 284 285
Crop                     crop_565                 1 1 78 286 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.0.state_select_list.1_ncnnreshape0 1 1 286 287 0=0 1=0
Crop                     crop_566                 1 1 93 288 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_18_ncnnreshape0 1 1 288 289 0=0 1=0
InnerProduct             linear_154               1 1 285 290 0=1024 1=1 2=393216
Split                    splitncnn_48             1 2 290 291 292
BinaryOp                 sub_35                   1 1 291 293 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 293 294
BinaryOp                 mul_36                   2 1 292 294 295 0=2
InnerProduct             linear_155               1 1 295 296 0=384 1=1 2=393216
BinaryOp                 add_37                   2 1 282 296 297 0=0
Split                    splitncnn_49             1 2 297 298 299
Crop                     select_5                 1 1 18 300 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_6                 1 1 3 301 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_472 3 3 299 301 300 302 303 304
InnerProduct             linear_156               1 1 302 305 0=384 1=0 2=147456
BinaryOp                 add_38                   2 1 298 305 306 0=0
Split                    splitncnn_50             1 2 306 307 308
Crop                     select_7                 1 1 33 309 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_8                 1 1 48 310 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_157               1 1 308 311 0=512 1=1 2=196608
Slice                    tensor_split_1           1 4 311 312 313 314 315 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 310 314 316 0=0
Reshape                  reshape_276              1 1 316 317 0=12 1=8 2=80
Reshape                  reshape_277              1 1 312 318 0=24 1=8 2=16
Reshape                  reshape_278              1 1 315 319 0=4 1=8 2=16
Concat                   cat_6                    2 1 309 313 320 0=0
Reshape                  reshape_279              1 1 320 321 0=24 1=8 2=80
Permute                  permute_492              1 1 319 322 0=2
MatMul                   matmul_387               2 1 322 190 323
Permute                  permute_493              1 1 321 324 0=3
Permute                  permute_491              1 1 318 325 0=2
MatMul                   matmul_388               2 1 325 324 326
TensorAsStrided          tensor_as_strided_586    1 1 323 327 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_39                   2 1 326 327 328 0=0
Reshape                  view_353                 1 1 328 329 0=80 1=16 2=8
Softmax                  softmax_81               1 1 329 330 0=-1 1=1
Split                    splitncnn_51             1 2 330 331 332
Permute                  permute_490              1 1 317 333 0=2
MatMul                   bmm_365                  2 1 332 333 334
Permute                  permute_494              1 1 334 335 0=2
Reshape                  reshape_280              1 1 335 336 0=96 1=16
InnerProduct             linear_158               1 1 336 337 0=384 1=1 2=36864
BinaryOp                 add_40                   2 1 307 337 338 0=0
Split                    splitncnn_52             1 2 338 339 340
Permute                  permute_424              1 1 340 341 0=1
Convolution1D            conv1d_98                1 1 341 342 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_2                    1 1 342 343 0=0
Concat                   cat_7                    2 1 287 343 344 0=1
ConvolutionDepthWise1D   convdw1d_604             1 1 344 345 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_53             1 2 345 346 347
BinaryOp                 sub_41                   1 1 346 348 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 348 349
BinaryOp                 mul_42                   2 1 347 349 350 0=2
Convolution1D            conv1d_99                1 1 350 351 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_425              1 1 351 352 0=1
BinaryOp                 add_43                   2 1 339 352 353 0=0
Split                    splitncnn_54             1 2 353 354 355
InnerProduct             linear_159               1 1 355 356 0=1024 1=1 2=393216
Split                    splitncnn_55             1 2 356 357 358
BinaryOp                 sub_44                   1 1 357 359 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 359 360
BinaryOp                 mul_45                   2 1 358 360 361 0=2
InnerProduct             linear_160               1 1 361 362 0=384 1=1 2=393216
BinaryOp                 add_46                   2 1 354 362 363 0=0
Split                    splitncnn_56             1 2 363 364 365
Crop                     select_9                 1 1 63 366 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_161               1 1 365 367 0=96 1=0 2=36864
Concat                   cat_8                    2 1 366 367 368 0=0
Reshape                  reshape_281              1 1 368 369 0=12 1=8 2=80
Permute                  permute_495              1 1 369 370 0=2
MatMul                   bmm_366                  2 1 331 370 371
Permute                  permute_496              1 1 371 372 0=2
Reshape                  reshape_282              1 1 372 373 0=96 1=16
InnerProduct             linear_162               1 1 373 374 0=384 1=1 2=36864
BinaryOp                 add_47                   2 1 364 374 375 0=0
Split                    splitncnn_57             1 2 375 376 377
Permute                  permute_426              1 1 377 378 0=1
Convolution1D            conv1d_100               1 1 378 379 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_3                    1 1 379 380 0=0
Concat                   cat_9                    2 1 289 380 381 0=1
ConvolutionDepthWise1D   convdw1d_605             1 1 381 382 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_58             1 2 382 383 384
BinaryOp                 sub_48                   1 1 383 385 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 385 386
BinaryOp                 mul_49                   2 1 384 386 387 0=2
Convolution1D            conv1d_101               1 1 387 388 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_427              1 1 388 389 0=1
BinaryOp                 add_50                   2 1 376 389 390 0=0
Split                    splitncnn_59             1 2 390 391 392
InnerProduct             linear_163               1 1 392 393 0=1024 1=1 2=393216
Split                    splitncnn_60             1 2 393 394 395
BinaryOp                 sub_51                   1 1 394 396 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 396 397
BinaryOp                 mul_52                   2 1 395 397 398 0=2
InnerProduct             linear_164               1 1 398 399 0=384 1=1 2=393216
BinaryOp                 add_53                   2 1 391 399 400 0=0
Split                    splitncnn_61             1 3 400 401 402 403
BinaryOp                 mul_54                   2 1 401 402 404 0=2
Reduction                mean_408                 1 1 404 405 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_55                   1 1 405 406 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_56                   1 1 406 407 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_57                   2 1 403 407 408 0=2
BinaryOp                 sub_58                   2 1 408 283 409 0=1
BinaryOp                 mul_59                   2 1 409 119 410 0=2
BinaryOp                 add_60                   2 1 284 410 411 0=0
Split                    splitncnn_62             1 2 411 412 413
MemoryData               encoder.encoders.1.downsample 0 1 414 0=384 1=1 2=1
Reshape                  reshape_283              1 1 413 415 0=384 1=2 2=8
Split                    splitncnn_63             1 2 415 416 417
BinaryOp                 mul_61                   2 1 416 414 418 0=2
Reduction                sum_464                  1 1 418 419 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_82               1 1 419 420 0=1 1=1
BinaryOp                 mul_62                   2 1 417 420 421 0=2
Reduction                sum_465                  1 1 421 422 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_567                 1 1 84 423 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 423 424 0=0 1=0
Crop                     crop_568                 1 1 99 425 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_26_ncnnreshape0 1 1 425 426 0=0 1=0
Split                    splitncnn_64             1 4 422 427 428 429 430
InnerProduct             linear_165               1 1 430 431 0=1024 1=1 2=393216
Split                    splitncnn_65             1 2 431 432 433
BinaryOp                 sub_63                   1 1 432 434 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 434 435
BinaryOp                 mul_64                   2 1 433 435 436 0=2
InnerProduct             linear_166               1 1 436 437 0=384 1=1 2=393216
BinaryOp                 add_65                   2 1 427 437 438 0=0
Split                    splitncnn_66             1 2 438 439 440
Crop                     select_10                1 1 24 441 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_11                1 1 9 442 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_473 3 3 440 442 441 443 444 445
InnerProduct             linear_167               1 1 443 446 0=384 1=0 2=147456
BinaryOp                 add_66                   2 1 439 446 447 0=0
Split                    splitncnn_67             1 2 447 448 449
Crop                     select_12                1 1 39 450 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_13                1 1 54 451 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_168               1 1 449 452 0=512 1=1 2=196608
Slice                    tensor_split_2           1 4 452 453 454 455 456 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 451 455 457 0=0
Reshape                  reshape_284              1 1 457 458 0=12 1=8 2=40
Reshape                  reshape_285              1 1 453 459 0=24 1=8 2=8
Reshape                  reshape_286              1 1 456 460 0=4 1=8 2=8
Concat                   cat_11                   2 1 450 454 461 0=0
Reshape                  reshape_287              1 1 461 462 0=24 1=8 2=40
InnerProduct             linear_169               1 1 118 463 0=32 1=0 2=12288
Reshape                  reshape_288              1 1 463 464 0=4 1=8 2=47
Permute                  permute_501              1 1 464 465 0=3
Split                    splitncnn_68             1 4 465 466 467 468 469
Permute                  permute_499              1 1 460 470 0=2
MatMul                   matmul_389               2 1 470 469 471
Permute                  permute_500              1 1 462 472 0=3
Permute                  permute_498              1 1 459 473 0=2
MatMul                   matmul_390               2 1 473 472 474
TensorAsStrided          tensor_as_strided_587    1 1 471 475 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_67                   2 1 474 475 476 0=0
Reshape                  view_354                 1 1 476 477 0=40 1=8 2=8
Softmax                  softmax_83               1 1 477 478 0=-1 1=1
Split                    splitncnn_69             1 2 478 479 480
Permute                  permute_497              1 1 458 481 0=2
MatMul                   bmm_367                  2 1 480 481 482
Permute                  permute_502              1 1 482 483 0=2
Reshape                  reshape_289              1 1 483 484 0=96 1=8
InnerProduct             linear_170               1 1 484 485 0=384 1=1 2=36864
BinaryOp                 add_68                   2 1 448 485 486 0=0
Split                    splitncnn_70             1 2 486 487 488
Permute                  permute_428              1 1 488 489 0=1
Convolution1D            conv1d_102               1 1 489 490 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_4                    1 1 490 491 0=0
Concat                   cat_12                   2 1 424 491 492 0=1
ConvolutionDepthWise1D   convdw1d_606             1 1 492 493 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_71             1 2 493 494 495
BinaryOp                 sub_69                   1 1 494 496 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 496 497
BinaryOp                 mul_70                   2 1 495 497 498 0=2
Convolution1D            conv1d_103               1 1 498 499 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_429              1 1 499 500 0=1
BinaryOp                 add_71                   2 1 487 500 501 0=0
Split                    splitncnn_72             1 2 501 502 503
InnerProduct             linear_171               1 1 503 504 0=1024 1=1 2=393216
Split                    splitncnn_73             1 2 504 505 506
BinaryOp                 sub_72                   1 1 505 507 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 507 508
BinaryOp                 mul_73                   2 1 506 508 509 0=2
InnerProduct             linear_172               1 1 509 510 0=384 1=1 2=393216
BinaryOp                 add_74                   2 1 502 510 511 0=0
Split                    splitncnn_74             1 2 511 512 513
Crop                     select_14                1 1 69 514 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_173               1 1 513 515 0=96 1=0 2=36864
Concat                   cat_13                   2 1 514 515 516 0=0
Reshape                  reshape_290              1 1 516 517 0=12 1=8 2=40
Permute                  permute_503              1 1 517 518 0=2
MatMul                   bmm_368                  2 1 479 518 519
Permute                  permute_504              1 1 519 520 0=2
Reshape                  reshape_291              1 1 520 521 0=96 1=8
InnerProduct             linear_174               1 1 521 522 0=384 1=1 2=36864
BinaryOp                 add_75                   2 1 512 522 523 0=0
Split                    splitncnn_75             1 2 523 524 525
Permute                  permute_430              1 1 525 526 0=1
Convolution1D            conv1d_104               1 1 526 527 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_5                    1 1 527 528 0=0
Concat                   cat_14                   2 1 426 528 529 0=1
ConvolutionDepthWise1D   convdw1d_607             1 1 529 530 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_76             1 2 530 531 532
BinaryOp                 sub_76                   1 1 531 533 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 533 534
BinaryOp                 mul_77                   2 1 532 534 535 0=2
Convolution1D            conv1d_105               1 1 535 536 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_431              1 1 536 537 0=1
BinaryOp                 add_78                   2 1 524 537 538 0=0
Split                    splitncnn_77             1 2 538 539 540
InnerProduct             linear_175               1 1 540 541 0=1024 1=1 2=393216
Split                    splitncnn_78             1 2 541 542 543
BinaryOp                 sub_79                   1 1 542 544 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 544 545
BinaryOp                 mul_80                   2 1 543 545 546 0=2
InnerProduct             linear_176               1 1 546 547 0=384 1=1 2=393216
BinaryOp                 add_81                   2 1 539 547 548 0=0
Split                    splitncnn_79             1 3 548 549 550 551
BinaryOp                 mul_82                   2 1 549 550 552 0=2
Reduction                mean_409                 1 1 552 553 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_83                   1 1 553 554 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_84                   1 1 554 555 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_85                   2 1 551 555 556 0=2
BinaryOp                 sub_86                   2 1 556 428 557 0=1
BinaryOp                 mul_87                   2 1 557 117 558 0=2
BinaryOp                 add_88                   2 1 429 558 559 0=0
Split                    splitncnn_80             1 4 559 560 561 562 563
Crop                     crop_569                 1 1 83 564 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 564 565 0=0 1=0
Crop                     crop_570                 1 1 98 566 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_34_ncnnreshape0 1 1 566 567 0=0 1=0
InnerProduct             linear_177               1 1 563 568 0=1024 1=1 2=393216
Split                    splitncnn_81             1 2 568 569 570
BinaryOp                 sub_89                   1 1 569 571 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 571 572
BinaryOp                 mul_90                   2 1 570 572 573 0=2
InnerProduct             linear_178               1 1 573 574 0=384 1=1 2=393216
BinaryOp                 add_91                   2 1 560 574 575 0=0
Split                    splitncnn_82             1 2 575 576 577
Crop                     select_15                1 1 23 578 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_16                1 1 8 579 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_474 3 3 577 579 578 580 581 582
InnerProduct             linear_179               1 1 580 583 0=384 1=0 2=147456
BinaryOp                 add_92                   2 1 576 583 584 0=0
Split                    splitncnn_83             1 2 584 585 586
Crop                     select_17                1 1 38 587 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_18                1 1 53 588 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_180               1 1 586 589 0=512 1=1 2=196608
Slice                    tensor_split_3           1 4 589 590 591 592 593 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 588 592 594 0=0
Reshape                  reshape_292              1 1 594 595 0=12 1=8 2=40
Reshape                  reshape_293              1 1 590 596 0=24 1=8 2=8
Reshape                  reshape_294              1 1 593 597 0=4 1=8 2=8
Concat                   cat_16                   2 1 587 591 598 0=0
Reshape                  reshape_295              1 1 598 599 0=24 1=8 2=40
Permute                  permute_507              1 1 597 600 0=2
MatMul                   matmul_391               2 1 600 468 601
Permute                  permute_508              1 1 599 602 0=3
Permute                  permute_506              1 1 596 603 0=2
MatMul                   matmul_392               2 1 603 602 604
TensorAsStrided          tensor_as_strided_588    1 1 601 605 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_93                   2 1 604 605 606 0=0
Reshape                  view_355                 1 1 606 607 0=40 1=8 2=8
Softmax                  softmax_84               1 1 607 608 0=-1 1=1
Split                    splitncnn_84             1 2 608 609 610
Permute                  permute_505              1 1 595 611 0=2
MatMul                   bmm_369                  2 1 610 611 612
Permute                  permute_509              1 1 612 613 0=2
Reshape                  reshape_296              1 1 613 614 0=96 1=8
InnerProduct             linear_181               1 1 614 615 0=384 1=1 2=36864
BinaryOp                 add_94                   2 1 585 615 616 0=0
Split                    splitncnn_85             1 2 616 617 618
Permute                  permute_432              1 1 618 619 0=1
Convolution1D            conv1d_106               1 1 619 620 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_6                    1 1 620 621 0=0
Concat                   cat_17                   2 1 565 621 622 0=1
ConvolutionDepthWise1D   convdw1d_608             1 1 622 623 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_86             1 2 623 624 625
BinaryOp                 sub_95                   1 1 624 626 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 626 627
BinaryOp                 mul_96                   2 1 625 627 628 0=2
Convolution1D            conv1d_107               1 1 628 629 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_433              1 1 629 630 0=1
BinaryOp                 add_97                   2 1 617 630 631 0=0
Split                    splitncnn_87             1 2 631 632 633
InnerProduct             linear_182               1 1 633 634 0=1024 1=1 2=393216
Split                    splitncnn_88             1 2 634 635 636
BinaryOp                 sub_98                   1 1 635 637 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 637 638
BinaryOp                 mul_99                   2 1 636 638 639 0=2
InnerProduct             linear_183               1 1 639 640 0=384 1=1 2=393216
BinaryOp                 add_100                  2 1 632 640 641 0=0
Split                    splitncnn_89             1 2 641 642 643
Crop                     select_19                1 1 68 644 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_184               1 1 643 645 0=96 1=0 2=36864
Concat                   cat_18                   2 1 644 645 646 0=0
Reshape                  reshape_297              1 1 646 647 0=12 1=8 2=40
Permute                  permute_510              1 1 647 648 0=2
MatMul                   bmm_370                  2 1 609 648 649
Permute                  permute_511              1 1 649 650 0=2
Reshape                  reshape_298              1 1 650 651 0=96 1=8
InnerProduct             linear_185               1 1 651 652 0=384 1=1 2=36864
BinaryOp                 add_101                  2 1 642 652 653 0=0
Split                    splitncnn_90             1 2 653 654 655
Permute                  permute_434              1 1 655 656 0=1
Convolution1D            conv1d_108               1 1 656 657 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_7                    1 1 657 658 0=0
Concat                   cat_19                   2 1 567 658 659 0=1
ConvolutionDepthWise1D   convdw1d_609             1 1 659 660 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_91             1 2 660 661 662
BinaryOp                 sub_102                  1 1 661 663 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 663 664
BinaryOp                 mul_103                  2 1 662 664 665 0=2
Convolution1D            conv1d_109               1 1 665 666 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_435              1 1 666 667 0=1
BinaryOp                 add_104                  2 1 654 667 668 0=0
Split                    splitncnn_92             1 2 668 669 670
InnerProduct             linear_186               1 1 670 671 0=1024 1=1 2=393216
Split                    splitncnn_93             1 2 671 672 673
BinaryOp                 sub_105                  1 1 672 674 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 674 675
BinaryOp                 mul_106                  2 1 673 675 676 0=2
InnerProduct             linear_187               1 1 676 677 0=384 1=1 2=393216
BinaryOp                 add_107                  2 1 669 677 678 0=0
Split                    splitncnn_94             1 3 678 679 680 681
BinaryOp                 mul_108                  2 1 679 680 682 0=2
Reduction                mean_410                 1 1 682 683 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_109                  1 1 683 684 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_110                  1 1 684 685 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_111                  2 1 681 685 686 0=2
BinaryOp                 sub_112                  2 1 686 561 687 0=1
BinaryOp                 mul_113                  2 1 687 116 688 0=2
BinaryOp                 add_114                  2 1 562 688 689 0=0
Split                    splitncnn_95             1 4 689 690 691 692 693
Crop                     crop_571                 1 1 82 694 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  encoder.encoders.1.encoder.state_select_list.2_ncnnreshape0 1 1 694 695 0=0 1=0
Crop                     crop_572                 1 1 97 696 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_42_ncnnreshape0 1 1 696 697 0=0 1=0
InnerProduct             linear_188               1 1 693 698 0=1024 1=1 2=393216
Split                    splitncnn_96             1 2 698 699 700
BinaryOp                 sub_115                  1 1 699 701 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 701 702
BinaryOp                 mul_116                  2 1 700 702 703 0=2
InnerProduct             linear_189               1 1 703 704 0=384 1=1 2=393216
BinaryOp                 add_117                  2 1 690 704 705 0=0
Split                    splitncnn_97             1 2 705 706 707
Crop                     select_20                1 1 22 708 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_21                1 1 7 709 -23310=1,3 -23311=1,0 -23309=1,2
PoolingModuleNoProj      pooling_modul_no_proj_475 3 3 707 709 708 710 711 712
InnerProduct             linear_190               1 1 710 713 0=384 1=0 2=147456
BinaryOp                 add_118                  2 1 706 713 714 0=0
Split                    splitncnn_98             1 2 714 715 716
Crop                     select_22                1 1 37 717 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_23                1 1 52 718 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_191               1 1 716 719 0=512 1=1 2=196608
Slice                    tensor_split_4           1 4 719 720 721 722 723 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 718 722 724 0=0
Reshape                  reshape_299              1 1 724 725 0=12 1=8 2=40
Reshape                  reshape_300              1 1 720 726 0=24 1=8 2=8
Reshape                  reshape_301              1 1 723 727 0=4 1=8 2=8
Concat                   cat_21                   2 1 717 721 728 0=0
Reshape                  reshape_302              1 1 728 729 0=24 1=8 2=40
Permute                  permute_514              1 1 727 730 0=2
MatMul                   matmul_393               2 1 730 467 731
Permute                  permute_515              1 1 729 732 0=3
Permute                  permute_513              1 1 726 733 0=2
MatMul                   matmul_394               2 1 733 732 734
TensorAsStrided          tensor_as_strided_589    1 1 731 735 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_119                  2 1 734 735 736 0=0
Reshape                  view_356                 1 1 736 737 0=40 1=8 2=8
Softmax                  softmax_85               1 1 737 738 0=-1 1=1
Split                    splitncnn_99             1 2 738 739 740
Permute                  permute_512              1 1 725 741 0=2
MatMul                   bmm_371                  2 1 740 741 742
Permute                  permute_516              1 1 742 743 0=2
Reshape                  reshape_303              1 1 743 744 0=96 1=8
InnerProduct             linear_192               1 1 744 745 0=384 1=1 2=36864
BinaryOp                 add_120                  2 1 715 745 746 0=0
Split                    splitncnn_100            1 2 746 747 748
Permute                  permute_436              1 1 748 749 0=1
Convolution1D            conv1d_110               1 1 749 750 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_8                    1 1 750 751 0=0
Concat                   cat_22                   2 1 695 751 752 0=1
ConvolutionDepthWise1D   convdw1d_610             1 1 752 753 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_101            1 2 753 754 755
BinaryOp                 sub_121                  1 1 754 756 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_46               1 1 756 757
BinaryOp                 mul_122                  2 1 755 757 758 0=2
Convolution1D            conv1d_111               1 1 758 759 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_437              1 1 759 760 0=1
BinaryOp                 add_123                  2 1 747 760 761 0=0
Split                    splitncnn_102            1 2 761 762 763
InnerProduct             linear_193               1 1 763 764 0=1024 1=1 2=393216
Split                    splitncnn_103            1 2 764 765 766
BinaryOp                 sub_124                  1 1 765 767 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_47               1 1 767 768
BinaryOp                 mul_125                  2 1 766 768 769 0=2
InnerProduct             linear_194               1 1 769 770 0=384 1=1 2=393216
BinaryOp                 add_126                  2 1 762 770 771 0=0
Split                    splitncnn_104            1 2 771 772 773
Crop                     select_24                1 1 67 774 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_195               1 1 773 775 0=96 1=0 2=36864
Concat                   cat_23                   2 1 774 775 776 0=0
Reshape                  reshape_304              1 1 776 777 0=12 1=8 2=40
Permute                  permute_517              1 1 777 778 0=2
MatMul                   bmm_372                  2 1 739 778 779
Permute                  permute_518              1 1 779 780 0=2
Reshape                  reshape_305              1 1 780 781 0=96 1=8
InnerProduct             linear_196               1 1 781 782 0=384 1=1 2=36864
BinaryOp                 add_127                  2 1 772 782 783 0=0
Split                    splitncnn_105            1 2 783 784 785
Permute                  permute_438              1 1 785 786 0=1
Convolution1D            conv1d_112               1 1 786 787 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_9                    1 1 787 788 0=0
Concat                   cat_24                   2 1 697 788 789 0=1
ConvolutionDepthWise1D   convdw1d_611             1 1 789 790 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_106            1 2 790 791 792
BinaryOp                 sub_128                  1 1 791 793 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_48               1 1 793 794
BinaryOp                 mul_129                  2 1 792 794 795 0=2
Convolution1D            conv1d_113               1 1 795 796 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_439              1 1 796 797 0=1
BinaryOp                 add_130                  2 1 784 797 798 0=0
Split                    splitncnn_107            1 2 798 799 800
InnerProduct             linear_197               1 1 800 801 0=1024 1=1 2=393216
Split                    splitncnn_108            1 2 801 802 803
BinaryOp                 sub_131                  1 1 802 804 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_49               1 1 804 805
BinaryOp                 mul_132                  2 1 803 805 806 0=2
InnerProduct             linear_198               1 1 806 807 0=384 1=1 2=393216
BinaryOp                 add_133                  2 1 799 807 808 0=0
Split                    splitncnn_109            1 3 808 809 810 811
BinaryOp                 mul_134                  2 1 809 810 812 0=2
Reduction                mean_411                 1 1 812 813 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_135                  1 1 813 814 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_136                  1 1 814 815 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_137                  2 1 811 815 816 0=2
BinaryOp                 sub_138                  2 1 816 691 817 0=1
BinaryOp                 mul_139                  2 1 817 115 818 0=2
BinaryOp                 add_140                  2 1 692 818 819 0=0
Split                    splitncnn_110            1 4 819 820 821 822 823
Crop                     crop_573                 1 1 81 824 -23310=1,4 -23311=1,0 -23309=1,3
Reshape                  encoder.encoders.1.encoder.state_select_list.3_ncnnreshape0 1 1 824 825 0=0 1=0
Crop                     crop_574                 1 1 96 826 -23310=1,4 -23311=1,0 -23309=1,3
Reshape                  pnnx_unique_50_ncnnreshape0 1 1 826 827 0=0 1=0
InnerProduct             linear_199               1 1 823 828 0=1024 1=1 2=393216
Split                    splitncnn_111            1 2 828 829 830
BinaryOp                 sub_141                  1 1 829 831 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_50               1 1 831 832
BinaryOp                 mul_142                  2 1 830 832 833 0=2
InnerProduct             linear_200               1 1 833 834 0=384 1=1 2=393216
BinaryOp                 add_143                  2 1 820 834 835 0=0
Split                    splitncnn_112            1 2 835 836 837
Crop                     select_25                1 1 21 838 -23310=1,4 -23311=1,0 -23309=1,3
Crop                     select_26                1 1 6 839 -23310=1,4 -23311=1,0 -23309=1,3
PoolingModuleNoProj      pooling_modul_no_proj_476 3 3 837 839 838 840 841 842
InnerProduct             linear_201               1 1 840 843 0=384 1=0 2=147456
BinaryOp                 add_144                  2 1 836 843 844 0=0
Split                    splitncnn_113            1 2 844 845 846
Crop                     select_27                1 1 36 847 -23310=1,4 -23311=1,0 -23309=1,3
Crop                     select_28                1 1 51 848 -23310=1,4 -23311=1,0 -23309=1,3
InnerProduct             linear_202               1 1 846 849 0=512 1=1 2=196608
Slice                    tensor_split_5           1 4 849 850 851 852 853 -23300=4,192,192,96,-233 1=1
