7767517
1983 2497
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Split                    splitncnn_1              1 4 in2 5 6 7 8
Input                    in3                      0 1 in3
Split                    splitncnn_2              1 3 in3 10 11 12
Input                    in4                      0 1 in4
Split                    splitncnn_3              1 2 in4 14 15
Input                    in5                      0 1 in5
Split                    splitncnn_4              1 4 in5 17 18 19 20
Input                    in6                      0 1 in6
Split                    splitncnn_5              1 2 in6 22 23
Input                    in7                      0 1 in7
Split                    splitncnn_6              1 4 in7 25 26 27 28
Input                    in8                      0 1 in8
Split                    splitncnn_7              1 3 in8 30 31 32
Input                    in9                      0 1 in9
Split                    splitncnn_8              1 2 in9 34 35
Input                    in10                     0 1 in10
Split                    splitncnn_9              1 4 in10 37 38 39 40
Input                    in11                     0 1 in11
Split                    splitncnn_10             1 2 in11 42 43
Input                    in12                     0 1 in12
Split                    splitncnn_11             1 4 in12 45 46 47 48
Input                    in13                     0 1 in13
Split                    splitncnn_12             1 3 in13 50 51 52
Input                    in14                     0 1 in14
Split                    splitncnn_13             1 2 in14 54 55
Input                    in15                     0 1 in15
Split                    splitncnn_14             1 4 in15 57 58 59 60
Input                    in16                     0 1 in16
Split                    splitncnn_15             1 2 in16 62 63
Input                    in17                     0 1 in17
Split                    splitncnn_16             1 4 in17 65 66 67 68
Input                    in18                     0 1 in18
Split                    splitncnn_17             1 3 in18 70 71 72
Input                    in19                     0 1 in19
Split                    splitncnn_18             1 2 in19 74 75
Input                    in20                     0 1 in20
Split                    splitncnn_19             1 4 in20 77 78 79 80
Input                    in21                     0 1 in21
Split                    splitncnn_20             1 2 in21 82 83
Input                    in22                     0 1 in22
Split                    splitncnn_21             1 4 in22 85 86 87 88
Input                    in23                     0 1 in23
Split                    splitncnn_22             1 3 in23 90 91 92
Input                    in24                     0 1 in24
Split                    splitncnn_23             1 2 in24 94 95
Input                    in25                     0 1 in25
Split                    splitncnn_24             1 4 in25 97 98 99 100
Input                    in26                     0 1 in26
Split                    splitncnn_25             1 2 in26 102 103
Input                    in27                     0 1 in27
Split                    splitncnn_26             1 4 in27 105 106 107 108
Input                    in28                     0 1 in28
Split                    splitncnn_27             1 3 in28 110 111 112
Input                    in29                     0 1 in29
Split                    splitncnn_28             1 2 in29 114 115
Input                    in30                     0 1 in30
Split                    splitncnn_29             1 4 in30 117 118 119 120
Input                    in31                     0 1 in31
Split                    splitncnn_30             1 2 in31 122 123
Input                    in32                     0 1 in32
Split                    splitncnn_31             1 4 in32 125 126 127 128
Input                    in33                     0 1 in33
Split                    splitncnn_32             1 3 in33 130 131 132
Input                    in34                     0 1 in34
Split                    splitncnn_33             1 2 in34 134 135
Input                    in35                     0 1 in35
Split                    splitncnn_34             1 4 in35 137 138 139 140
MemoryData               encoder.encoders.4.encoder.layers.3 0 1 141 0=1
MemoryData               encoder.encoders.4.encoder.layers.2 0 1 142 0=1
MemoryData               encoder.encoders.4.encoder.layers.1 0 1 143 0=1
MemoryData               encoder.encoders.4.encoder.layers.0 0 1 144 0=1
MemoryData               encoder.encoders.4.encoder.encoder_pos 0 1 145 0=384 1=47 2=1
MemoryData               encoder.encoders.3.encoder.layers.1 0 1 146 0=1
MemoryData               encoder.encoders.3.encoder.layers.0 0 1 147 0=1
MemoryData               encoder.encoders.3.encoder.encoder_pos 0 1 148 0=384 1=11 2=1
MemoryData               encoder.encoders.2.encoder.layers.2 0 1 149 0=1
MemoryData               encoder.encoders.2.encoder.layers.1 0 1 150 0=1
MemoryData               encoder.encoders.2.encoder.layers.0 0 1 151 0=1
MemoryData               encoder.encoders.2.encoder.encoder_pos 0 1 152 0=384 1=23 2=1
MemoryData               encoder.encoders.1.encoder.layers.3 0 1 153 0=1
MemoryData               encoder.encoders.1.encoder.layers.2 0 1 154 0=1
MemoryData               encoder.encoders.1.encoder.layers.1 0 1 155 0=1
MemoryData               encoder.encoders.1.encoder.layers.0 0 1 156 0=1
MemoryData               encoder.encoders.1.encoder.encoder_pos 0 1 157 0=384 1=47 2=1
MemoryData               encoder.encoders.0.layers.1 0 1 158 0=1
MemoryData               encoder.encoders.0.layers.0 0 1 159 0=1
MemoryData               encoder.encoders.0.encoder_pos 0 1 160 0=384 1=95 2=1
ExpandDims               unsqueeze_716            1 1 in0 161 -23303=1,0
Convolution              conv_188                 1 1 161 162 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_35             1 2 162 163 164
BinaryOp                 sub_0                    1 1 163 165 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 165 166
BinaryOp                 mul_1                    2 1 164 166 167 0=2
Convolution              conv_189                 1 1 167 168 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_36             1 2 168 169 170
BinaryOp                 sub_2                    1 1 169 171 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 171 172
BinaryOp                 mul_3                    2 1 170 172 173 0=2
Convolution              conv_190                 1 1 173 174 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_37             1 2 174 175 176
BinaryOp                 sub_4                    1 1 175 177 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 177 178
BinaryOp                 mul_5                    2 1 176 178 179 0=2
Crop                     crop_842                 1 1 103 180 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.0.state_select_list.0_ncnnreshape0 1 1 180 181 0=0 1=0
Crop                     crop_843                 1 1 123 182 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_15_ncnnreshape0 1 1 182 183 0=0 1=0
Permute                  permute_643              1 1 179 184 0=2
Reshape                  reshape_362              1 1 184 185 0=2432 1=-1
InnerProduct             linear_191               1 1 185 186 0=384 1=1 2=933888
Split                    splitncnn_38             1 4 186 187 188 189 190
InnerProduct             linear_192               1 1 190 191 0=1024 1=1 2=393216
Split                    splitncnn_39             1 2 191 192 193
BinaryOp                 sub_6                    1 1 192 194 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 194 195
BinaryOp                 mul_7                    2 1 193 195 196 0=2
InnerProduct             linear_193               1 1 196 197 0=384 1=1 2=393216
BinaryOp                 add_8                    2 1 187 197 198 0=0
Split                    splitncnn_40             1 2 198 199 200
Crop                     select_0                 1 1 23 201 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_1                 1 1 3 202 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_717 3 3 200 202 201 203 204 205
InnerProduct             linear_194               1 1 203 206 0=384 1=0 2=147456
BinaryOp                 add_9                    2 1 199 206 207 0=0
Split                    splitncnn_41             1 2 207 208 209
Crop                     select_2                 1 1 43 210 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_3                 1 1 63 211 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_195               1 1 209 212 0=512 1=1 2=196608
Slice                    tensor_split_0           1 4 212 213 214 215 216 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 211 215 217 0=0
Split                    splitncnn_42             1 2 217 218 219
Reshape                  reshape_363              1 1 218 220 0=12 1=8 2=80
Reshape                  reshape_364              1 1 213 221 0=24 1=8 2=16
Reshape                  reshape_365              1 1 216 222 0=4 1=8 2=16
Concat                   cat_1                    2 1 210 214 223 0=0
Split                    splitncnn_43             1 2 223 224 225
Reshape                  reshape_366              1 1 224 226 0=24 1=8 2=80
InnerProduct             linear_196               1 1 160 227 0=32 1=0 2=12288
Reshape                  reshape_367              1 1 227 228 0=4 1=8 2=95
Permute                  permute_736              1 1 228 229 0=3
Split                    splitncnn_44             1 2 229 230 231
Permute                  permute_734              1 1 222 232 0=2
MatMul                   matmul_598               2 1 232 231 233
Permute                  permute_735              1 1 226 234 0=3
Permute                  permute_733              1 1 221 235 0=2
MatMul                   matmul_599               2 1 235 234 236
TensorAsStrided          tensor_as_strided_872    1 1 233 237 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_10                   2 1 236 237 238 0=0
Reshape                  view_553                 1 1 238 239 0=80 1=16 2=8
Softmax                  softmax_108              1 1 239 240 0=-1 1=1
Split                    splitncnn_45             1 2 240 241 242
Permute                  permute_732              1 1 220 243 0=2
MatMul                   bmm_568                  2 1 242 243 244
Permute                  permute_737              1 1 244 245 0=2
Reshape                  reshape_368              1 1 245 246 0=96 1=16
InnerProduct             linear_197               1 1 246 247 0=384 1=1 2=36864
BinaryOp                 add_11                   2 1 208 247 248 0=0
Split                    splitncnn_46             1 2 248 249 250
Permute                  permute_645              1 1 250 251 0=1
Convolution1D            conv1d_128               1 1 251 252 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_0                    1 1 252 253 0=0
Concat                   cat_2                    2 1 181 253 254 0=1
Split                    splitncnn_47             1 2 254 255 256
ConvolutionDepthWise1D   convdw1d_896             1 1 256 257 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_48             1 2 257 258 259
BinaryOp                 sub_12                   1 1 258 260 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 260 261
BinaryOp                 mul_13                   2 1 259 261 262 0=2
Convolution1D            conv1d_129               1 1 262 263 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_646              1 1 263 264 0=1
BinaryOp                 add_14                   2 1 249 264 265 0=0
Split                    splitncnn_49             1 2 265 266 267
InnerProduct             linear_198               1 1 267 268 0=1024 1=1 2=393216
Split                    splitncnn_50             1 2 268 269 270
BinaryOp                 sub_15                   1 1 269 271 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 271 272
BinaryOp                 mul_16                   2 1 270 272 273 0=2
InnerProduct             linear_199               1 1 273 274 0=384 1=1 2=393216
BinaryOp                 add_17                   2 1 266 274 275 0=0
Split                    splitncnn_51             1 2 275 276 277
Crop                     select_4                 1 1 83 278 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_200               1 1 277 279 0=96 1=0 2=36864
Concat                   cat_3                    2 1 278 279 280 0=0
Split                    splitncnn_52             1 2 280 281 282
Reshape                  reshape_369              1 1 281 283 0=12 1=8 2=80
Permute                  permute_738              1 1 283 284 0=2
MatMul                   bmm_569                  2 1 241 284 285
Permute                  permute_739              1 1 285 286 0=2
Reshape                  reshape_370              1 1 286 287 0=96 1=16
InnerProduct             linear_201               1 1 287 288 0=384 1=1 2=36864
BinaryOp                 add_18                   2 1 276 288 289 0=0
Split                    splitncnn_53             1 2 289 290 291
Permute                  permute_647              1 1 291 292 0=1
Convolution1D            conv1d_130               1 1 292 293 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_1                    1 1 293 294 0=0
Concat                   cat_4                    2 1 183 294 295 0=1
Split                    splitncnn_54             1 2 295 296 297
ConvolutionDepthWise1D   convdw1d_897             1 1 297 298 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_55             1 2 298 299 300
BinaryOp                 sub_19                   1 1 299 301 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 301 302
BinaryOp                 mul_20                   2 1 300 302 303 0=2
Convolution1D            conv1d_131               1 1 303 304 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_648              1 1 304 305 0=1
BinaryOp                 add_21                   2 1 290 305 306 0=0
Split                    splitncnn_56             1 2 306 307 308
InnerProduct             linear_202               1 1 308 309 0=1024 1=1 2=393216
Split                    splitncnn_57             1 2 309 310 311
BinaryOp                 sub_22                   1 1 310 312 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 312 313
BinaryOp                 mul_23                   2 1 311 313 314 0=2
InnerProduct             linear_203               1 1 314 315 0=384 1=1 2=393216
BinaryOp                 add_24                   2 1 307 315 316 0=0
Split                    splitncnn_58             1 3 316 317 318 319
BinaryOp                 mul_25                   2 1 317 318 320 0=2
Reduction                mean_628                 1 1 320 321 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_26                   1 1 321 322 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_27                   1 1 322 323 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_28                   2 1 319 323 324 0=2
BinaryOp                 sub_29                   2 1 324 188 325 0=1
BinaryOp                 mul_30                   2 1 325 159 326 0=2
BinaryOp                 add_31                   2 1 189 326 327 0=0
Split                    splitncnn_59             1 4 327 328 329 330 331
Crop                     crop_844                 1 1 102 332 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.0.state_select_list.1_ncnnreshape0 1 1 332 333 0=0 1=0
Crop                     crop_845                 1 1 122 334 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_22_ncnnreshape0 1 1 334 335 0=0 1=0
InnerProduct             linear_204               1 1 331 336 0=1024 1=1 2=393216
Split                    splitncnn_60             1 2 336 337 338
BinaryOp                 sub_32                   1 1 337 339 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 339 340
BinaryOp                 mul_33                   2 1 338 340 341 0=2
InnerProduct             linear_205               1 1 341 342 0=384 1=1 2=393216
BinaryOp                 add_34                   2 1 328 342 343 0=0
Split                    splitncnn_61             1 2 343 344 345
Crop                     select_5                 1 1 22 346 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_6                 1 1 2 347 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_718 3 3 345 347 346 348 349 350
InnerProduct             linear_206               1 1 348 351 0=384 1=0 2=147456
BinaryOp                 add_35                   2 1 344 351 352 0=0
Split                    splitncnn_62             1 2 352 353 354
Crop                     select_7                 1 1 42 355 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_8                 1 1 62 356 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_207               1 1 354 357 0=512 1=1 2=196608
Slice                    tensor_split_1           1 4 357 358 359 360 361 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 356 360 362 0=0
Split                    splitncnn_63             1 2 362 363 364
Reshape                  reshape_371              1 1 363 365 0=12 1=8 2=80
Reshape                  reshape_372              1 1 358 366 0=24 1=8 2=16
Reshape                  reshape_373              1 1 361 367 0=4 1=8 2=16
Concat                   cat_6                    2 1 355 359 368 0=0
Split                    splitncnn_64             1 2 368 369 370
Reshape                  reshape_374              1 1 369 371 0=24 1=8 2=80
Permute                  permute_742              1 1 367 372 0=2
MatMul                   matmul_600               2 1 372 230 373
Permute                  permute_743              1 1 371 374 0=3
Permute                  permute_741              1 1 366 375 0=2
MatMul                   matmul_601               2 1 375 374 376
TensorAsStrided          tensor_as_strided_873    1 1 373 377 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_36                   2 1 376 377 378 0=0
Reshape                  view_554                 1 1 378 379 0=80 1=16 2=8
Softmax                  softmax_109              1 1 379 380 0=-1 1=1
Split                    splitncnn_65             1 2 380 381 382
Permute                  permute_740              1 1 365 383 0=2
MatMul                   bmm_570                  2 1 382 383 384
Permute                  permute_744              1 1 384 385 0=2
Reshape                  reshape_375              1 1 385 386 0=96 1=16
InnerProduct             linear_208               1 1 386 387 0=384 1=1 2=36864
BinaryOp                 add_37                   2 1 353 387 388 0=0
Split                    splitncnn_66             1 2 388 389 390
Permute                  permute_649              1 1 390 391 0=1
Convolution1D            conv1d_132               1 1 391 392 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_2                    1 1 392 393 0=0
Concat                   cat_7                    2 1 333 393 394 0=1
Split                    splitncnn_67             1 2 394 395 396
ConvolutionDepthWise1D   convdw1d_898             1 1 396 397 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_68             1 2 397 398 399
BinaryOp                 sub_38                   1 1 398 400 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 400 401
BinaryOp                 mul_39                   2 1 399 401 402 0=2
Convolution1D            conv1d_133               1 1 402 403 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_650              1 1 403 404 0=1
BinaryOp                 add_40                   2 1 389 404 405 0=0
Split                    splitncnn_69             1 2 405 406 407
InnerProduct             linear_209               1 1 407 408 0=1024 1=1 2=393216
Split                    splitncnn_70             1 2 408 409 410
BinaryOp                 sub_41                   1 1 409 411 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 411 412
BinaryOp                 mul_42                   2 1 410 412 413 0=2
InnerProduct             linear_210               1 1 413 414 0=384 1=1 2=393216
BinaryOp                 add_43                   2 1 406 414 415 0=0
Split                    splitncnn_71             1 2 415 416 417
Crop                     select_9                 1 1 82 418 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_211               1 1 417 419 0=96 1=0 2=36864
Concat                   cat_8                    2 1 418 419 420 0=0
Split                    splitncnn_72             1 2 420 421 422
Reshape                  reshape_376              1 1 421 423 0=12 1=8 2=80
Permute                  permute_745              1 1 423 424 0=2
MatMul                   bmm_571                  2 1 381 424 425
Permute                  permute_746              1 1 425 426 0=2
Reshape                  reshape_377              1 1 426 427 0=96 1=16
InnerProduct             linear_212               1 1 427 428 0=384 1=1 2=36864
BinaryOp                 add_44                   2 1 416 428 429 0=0
Split                    splitncnn_73             1 2 429 430 431
Permute                  permute_651              1 1 431 432 0=1
Convolution1D            conv1d_134               1 1 432 433 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_3                    1 1 433 434 0=0
Concat                   cat_9                    2 1 335 434 435 0=1
Split                    splitncnn_74             1 2 435 436 437
ConvolutionDepthWise1D   convdw1d_899             1 1 437 438 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_75             1 2 438 439 440
BinaryOp                 sub_45                   1 1 439 441 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 441 442
BinaryOp                 mul_46                   2 1 440 442 443 0=2
Convolution1D            conv1d_135               1 1 443 444 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_652              1 1 444 445 0=1
BinaryOp                 add_47                   2 1 430 445 446 0=0
Split                    splitncnn_76             1 2 446 447 448
InnerProduct             linear_213               1 1 448 449 0=1024 1=1 2=393216
Split                    splitncnn_77             1 2 449 450 451
BinaryOp                 sub_48                   1 1 450 452 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 452 453
BinaryOp                 mul_49                   2 1 451 453 454 0=2
InnerProduct             linear_214               1 1 454 455 0=384 1=1 2=393216
BinaryOp                 add_50                   2 1 447 455 456 0=0
Split                    splitncnn_78             1 3 456 457 458 459
BinaryOp                 mul_51                   2 1 457 458 460 0=2
Reduction                mean_629                 1 1 460 461 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 461 462 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_53                   1 1 462 463 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 459 463 464 0=2
BinaryOp                 sub_55                   2 1 464 329 465 0=1
BinaryOp                 mul_56                   2 1 465 158 466 0=2
BinaryOp                 add_57                   2 1 330 466 467 0=0
Split                    splitncnn_79             1 2 467 468 469
MemoryData               encoder.encoders.1.downsample 0 1 470 0=384 1=1
Reshape                  reshape_378              1 1 469 471 0=384 1=2 2=8
Split                    splitncnn_80             1 2 471 472 473
BinaryOp                 mul_58                   2 1 472 470 474 0=2
Reduction                sum_706                  1 1 474 475 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_110              1 1 475 476
BinaryOp                 mul_59                   2 1 473 476 477 0=2
Reduction                sum_707                  1 1 477 478 0=0 1=0 -23303=0 4=0 5=1
Crop                     crop_846                 1 1 108 479 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 479 480 0=0 1=0
Crop                     crop_847                 1 1 128 481 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_30_ncnnreshape0 1 1 481 482 0=0 1=0
Split                    splitncnn_81             1 4 478 483 484 485 486
InnerProduct             linear_215               1 1 486 487 0=1024 1=1 2=393216
Split                    splitncnn_82             1 2 487 488 489
BinaryOp                 sub_60                   1 1 488 490 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 490 491
BinaryOp                 mul_61                   2 1 489 491 492 0=2
InnerProduct             linear_216               1 1 492 493 0=384 1=1 2=393216
BinaryOp                 add_62                   2 1 483 493 494 0=0
Split                    splitncnn_83             1 2 494 495 496
Crop                     select_10                1 1 28 497 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_11                1 1 8 498 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_719 3 3 496 498 497 499 500 501
InnerProduct             linear_217               1 1 499 502 0=384 1=0 2=147456
BinaryOp                 add_63                   2 1 495 502 503 0=0
Split                    splitncnn_84             1 2 503 504 505
Crop                     select_12                1 1 48 506 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_13                1 1 68 507 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_218               1 1 505 508 0=512 1=1 2=196608
Slice                    tensor_split_2           1 4 508 509 510 511 512 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 507 511 513 0=0
Split                    splitncnn_85             1 2 513 514 515
Reshape                  reshape_379              1 1 514 516 0=12 1=8 2=40
Reshape                  reshape_380              1 1 509 517 0=24 1=8 2=8
Reshape                  reshape_381              1 1 512 518 0=4 1=8 2=8
Concat                   cat_11                   2 1 506 510 519 0=0
Split                    splitncnn_86             1 2 519 520 521
Reshape                  reshape_382              1 1 520 522 0=24 1=8 2=40
InnerProduct             linear_219               1 1 157 523 0=32 1=0 2=12288
Reshape                  reshape_383              1 1 523 524 0=4 1=8 2=47
Permute                  permute_751              1 1 524 525 0=3
Split                    splitncnn_87             1 4 525 526 527 528 529
Permute                  permute_749              1 1 518 530 0=2
MatMul                   matmul_602               2 1 530 529 531
Permute                  permute_750              1 1 522 532 0=3
Permute                  permute_748              1 1 517 533 0=2
MatMul                   matmul_603               2 1 533 532 534
TensorAsStrided          tensor_as_strided_874    1 1 531 535 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_64                   2 1 534 535 536 0=0
Reshape                  view_555                 1 1 536 537 0=40 1=8 2=8
Softmax                  softmax_111              1 1 537 538 0=-1 1=1
Split                    splitncnn_88             1 2 538 539 540
Permute                  permute_747              1 1 516 541 0=2
MatMul                   bmm_572                  2 1 540 541 542
Permute                  permute_752              1 1 542 543 0=2
Reshape                  reshape_384              1 1 543 544 0=96 1=8
InnerProduct             linear_220               1 1 544 545 0=384 1=1 2=36864
BinaryOp                 add_65                   2 1 504 545 546 0=0
Split                    splitncnn_89             1 2 546 547 548
Permute                  permute_653              1 1 548 549 0=1
Convolution1D            conv1d_136               1 1 549 550 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_4                    1 1 550 551 0=0
Concat                   cat_12                   2 1 480 551 552 0=1
Split                    splitncnn_90             1 2 552 553 554
ConvolutionDepthWise1D   convdw1d_900             1 1 554 555 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_91             1 2 555 556 557
BinaryOp                 sub_66                   1 1 556 558 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 558 559
BinaryOp                 mul_67                   2 1 557 559 560 0=2
Convolution1D            conv1d_137               1 1 560 561 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_654              1 1 561 562 0=1
BinaryOp                 add_68                   2 1 547 562 563 0=0
Split                    splitncnn_92             1 2 563 564 565
InnerProduct             linear_221               1 1 565 566 0=1024 1=1 2=393216
Split                    splitncnn_93             1 2 566 567 568
BinaryOp                 sub_69                   1 1 567 569 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 569 570
BinaryOp                 mul_70                   2 1 568 570 571 0=2
InnerProduct             linear_222               1 1 571 572 0=384 1=1 2=393216
BinaryOp                 add_71                   2 1 564 572 573 0=0
Split                    splitncnn_94             1 2 573 574 575
Crop                     select_14                1 1 88 576 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_223               1 1 575 577 0=96 1=0 2=36864
Concat                   cat_13                   2 1 576 577 578 0=0
Split                    splitncnn_95             1 2 578 579 580
Reshape                  reshape_385              1 1 579 581 0=12 1=8 2=40
Permute                  permute_753              1 1 581 582 0=2
MatMul                   bmm_573                  2 1 539 582 583
Permute                  permute_754              1 1 583 584 0=2
Reshape                  reshape_386              1 1 584 585 0=96 1=8
InnerProduct             linear_224               1 1 585 586 0=384 1=1 2=36864
BinaryOp                 add_72                   2 1 574 586 587 0=0
Split                    splitncnn_96             1 2 587 588 589
Permute                  permute_655              1 1 589 590 0=1
Convolution1D            conv1d_138               1 1 590 591 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_5                    1 1 591 592 0=0
Concat                   cat_14                   2 1 482 592 593 0=1
Split                    splitncnn_97             1 2 593 594 595
ConvolutionDepthWise1D   convdw1d_901             1 1 595 596 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_98             1 2 596 597 598
BinaryOp                 sub_73                   1 1 597 599 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_46               1 1 599 600
BinaryOp                 mul_74                   2 1 598 600 601 0=2
Convolution1D            conv1d_139               1 1 601 602 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_656              1 1 602 603 0=1
BinaryOp                 add_75                   2 1 588 603 604 0=0
Split                    splitncnn_99             1 2 604 605 606
InnerProduct             linear_225               1 1 606 607 0=1024 1=1 2=393216
Split                    splitncnn_100            1 2 607 608 609
BinaryOp                 sub_76                   1 1 608 610 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_47               1 1 610 611
BinaryOp                 mul_77                   2 1 609 611 612 0=2
InnerProduct             linear_226               1 1 612 613 0=384 1=1 2=393216
BinaryOp                 add_78                   2 1 605 613 614 0=0
Split                    splitncnn_101            1 3 614 615 616 617
BinaryOp                 mul_79                   2 1 615 616 618 0=2
Reduction                mean_630                 1 1 618 619 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_80                   1 1 619 620 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_81                   1 1 620 621 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_82                   2 1 617 621 622 0=2
BinaryOp                 sub_83                   2 1 622 484 623 0=1
BinaryOp                 mul_84                   2 1 623 156 624 0=2
BinaryOp                 add_85                   2 1 485 624 625 0=0
Split                    splitncnn_102            1 4 625 626 627 628 629
Crop                     crop_848                 1 1 107 630 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 630 631 0=0 1=0
Crop                     crop_849                 1 1 127 632 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_38_ncnnreshape0 1 1 632 633 0=0 1=0
InnerProduct             linear_227               1 1 629 634 0=1024 1=1 2=393216
Split                    splitncnn_103            1 2 634 635 636
BinaryOp                 sub_86                   1 1 635 637 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_48               1 1 637 638
BinaryOp                 mul_87                   2 1 636 638 639 0=2
InnerProduct             linear_228               1 1 639 640 0=384 1=1 2=393216
BinaryOp                 add_88                   2 1 626 640 641 0=0
Split                    splitncnn_104            1 2 641 642 643
Crop                     select_15                1 1 27 644 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_16                1 1 7 645 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_720 3 3 643 645 644 646 647 648
InnerProduct             linear_229               1 1 646 649 0=384 1=0 2=147456
BinaryOp                 add_89                   2 1 642 649 650 0=0
Split                    splitncnn_105            1 2 650 651 652
Crop                     select_17                1 1 47 653 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_18                1 1 67 654 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_230               1 1 652 655 0=512 1=1 2=196608
Slice                    tensor_split_3           1 4 655 656 657 658 659 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 654 658 660 0=0
Split                    splitncnn_106            1 2 660 661 662
Reshape                  reshape_387              1 1 661 663 0=12 1=8 2=40
Reshape                  reshape_388              1 1 656 664 0=24 1=8 2=8
Reshape                  reshape_389              1 1 659 665 0=4 1=8 2=8
Concat                   cat_16                   2 1 653 657 666 0=0
Split                    splitncnn_107            1 2 666 667 668
Reshape                  reshape_390              1 1 667 669 0=24 1=8 2=40
Permute                  permute_757              1 1 665 670 0=2
MatMul                   matmul_604               2 1 670 528 671
Permute                  permute_758              1 1 669 672 0=3
Permute                  permute_756              1 1 664 673 0=2
MatMul                   matmul_605               2 1 673 672 674
TensorAsStrided          tensor_as_strided_875    1 1 671 675 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_90                   2 1 674 675 676 0=0
Reshape                  view_556                 1 1 676 677 0=40 1=8 2=8
Softmax                  softmax_112              1 1 677 678 0=-1 1=1
Split                    splitncnn_108            1 2 678 679 680
Permute                  permute_755              1 1 663 681 0=2
MatMul                   bmm_574                  2 1 680 681 682
Permute                  permute_759              1 1 682 683 0=2
Reshape                  reshape_391              1 1 683 684 0=96 1=8
InnerProduct             linear_231               1 1 684 685 0=384 1=1 2=36864
BinaryOp                 add_91                   2 1 651 685 686 0=0
Split                    splitncnn_109            1 2 686 687 688
Permute                  permute_657              1 1 688 689 0=1
Convolution1D            conv1d_140               1 1 689 690 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_6                    1 1 690 691 0=0
Concat                   cat_17                   2 1 631 691 692 0=1
Split                    splitncnn_110            1 2 692 693 694
ConvolutionDepthWise1D   convdw1d_902             1 1 694 695 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_111            1 2 695 696 697
BinaryOp                 sub_92                   1 1 696 698 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_49               1 1 698 699
BinaryOp                 mul_93                   2 1 697 699 700 0=2
Convolution1D            conv1d_141               1 1 700 701 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_658              1 1 701 702 0=1
BinaryOp                 add_94                   2 1 687 702 703 0=0
Split                    splitncnn_112            1 2 703 704 705
InnerProduct             linear_232               1 1 705 706 0=1024 1=1 2=393216
Split                    splitncnn_113            1 2 706 707 708
BinaryOp                 sub_95                   1 1 707 709 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_50               1 1 709 710
BinaryOp                 mul_96                   2 1 708 710 711 0=2
InnerProduct             linear_233               1 1 711 712 0=384 1=1 2=393216
BinaryOp                 add_97                   2 1 704 712 713 0=0
Split                    splitncnn_114            1 2 713 714 715
Crop                     select_19                1 1 87 716 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_234               1 1 715 717 0=96 1=0 2=36864
Concat                   cat_18                   2 1 716 717 718 0=0
Split                    splitncnn_115            1 2 718 719 720
Reshape                  reshape_392              1 1 719 721 0=12 1=8 2=40
Permute                  permute_760              1 1 721 722 0=2
MatMul                   bmm_575                  2 1 679 722 723
Permute                  permute_761              1 1 723 724 0=2
Reshape                  reshape_393              1 1 724 725 0=96 1=8
InnerProduct             linear_235               1 1 725 726 0=384 1=1 2=36864
BinaryOp                 add_98                   2 1 714 726 727 0=0
Split                    splitncnn_116            1 2 727 728 729
Permute                  permute_659              1 1 729 730 0=1
Convolution1D            conv1d_142               1 1 730 731 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_7                    1 1 731 732 0=0
Concat                   cat_19                   2 1 633 732 733 0=1
Split                    splitncnn_117            1 2 733 734 735
ConvolutionDepthWise1D   convdw1d_903             1 1 735 736 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_118            1 2 736 737 738
BinaryOp                 sub_99                   1 1 737 739 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_51               1 1 739 740
BinaryOp                 mul_100                  2 1 738 740 741 0=2
Convolution1D            conv1d_143               1 1 741 742 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_660              1 1 742 743 0=1
BinaryOp                 add_101                  2 1 728 743 744 0=0
Split                    splitncnn_119            1 2 744 745 746
InnerProduct             linear_236               1 1 746 747 0=1024 1=1 2=393216
Split                    splitncnn_120            1 2 747 748 749
BinaryOp                 sub_102                  1 1 748 750 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_52               1 1 750 751
BinaryOp                 mul_103                  2 1 749 751 752 0=2
InnerProduct             linear_237               1 1 752 753 0=384 1=1 2=393216
BinaryOp                 add_104                  2 1 745 753 754 0=0
Split                    splitncnn_121            1 3 754 755 756 757
BinaryOp                 mul_105                  2 1 755 756 758 0=2
Reduction                mean_631                 1 1 758 759 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_106                  1 1 759 760 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_107                  1 1 760 761 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_108                  2 1 757 761 762 0=2
BinaryOp                 sub_109                  2 1 762 627 763 0=1
BinaryOp                 mul_110                  2 1 763 155 764 0=2
BinaryOp                 add_111                  2 1 628 764 765 0=0
Split                    splitncnn_122            1 4 765 766 767 768 769
Crop                     crop_850                 1 1 106 770 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  encoder.encoders.1.encoder.state_select_list.2_ncnnreshape0 1 1 770 771 0=0 1=0
Crop                     crop_851                 1 1 126 772 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_46_ncnnreshape0 1 1 772 773 0=0 1=0
InnerProduct             linear_238               1 1 769 774 0=1024 1=1 2=393216
Split                    splitncnn_123            1 2 774 775 776
BinaryOp                 sub_112                  1 1 775 777 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_53               1 1 777 778
BinaryOp                 mul_113                  2 1 776 778 779 0=2
InnerProduct             linear_239               1 1 779 780 0=384 1=1 2=393216
BinaryOp                 add_114                  2 1 766 780 781 0=0
Split                    splitncnn_124            1 2 781 782 783
Crop                     select_20                1 1 26 784 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_21                1 1 6 785 -23310=1,3 -23311=1,0 -23309=1,2
PoolingModuleNoProj      pooling_modul_no_proj_721 3 3 783 785 784 786 787 788
InnerProduct             linear_240               1 1 786 789 0=384 1=0 2=147456
BinaryOp                 add_115                  2 1 782 789 790 0=0
Split                    splitncnn_125            1 2 790 791 792
Crop                     select_22                1 1 46 793 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_23                1 1 66 794 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_241               1 1 792 795 0=512 1=1 2=196608
Slice                    tensor_split_4           1 4 795 796 797 798 799 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 794 798 800 0=0
Split                    splitncnn_126            1 2 800 801 802
Reshape                  reshape_394              1 1 801 803 0=12 1=8 2=40
Reshape                  reshape_395              1 1 796 804 0=24 1=8 2=8
Reshape                  reshape_396              1 1 799 805 0=4 1=8 2=8
Concat                   cat_21                   2 1 793 797 806 0=0
Split                    splitncnn_127            1 2 806 807 808
Reshape                  reshape_397              1 1 807 809 0=24 1=8 2=40
Permute                  permute_764              1 1 805 810 0=2
MatMul                   matmul_606               2 1 810 527 811
Permute                  permute_765              1 1 809 812 0=3
Permute                  permute_763              1 1 804 813 0=2
MatMul                   matmul_607               2 1 813 812 814
TensorAsStrided          tensor_as_strided_876    1 1 811 815 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_116                  2 1 814 815 816 0=0
Reshape                  view_557                 1 1 816 817 0=40 1=8 2=8
Softmax                  softmax_113              1 1 817 818 0=-1 1=1
Split                    splitncnn_128            1 2 818 819 820
Permute                  permute_762              1 1 803 821 0=2
MatMul                   bmm_576                  2 1 820 821 822
Permute                  permute_766              1 1 822 823 0=2
Reshape                  reshape_398              1 1 823 824 0=96 1=8
InnerProduct             linear_242               1 1 824 825 0=384 1=1 2=36864
BinaryOp                 add_117                  2 1 791 825 826 0=0
Split                    splitncnn_129            1 2 826 827 828
Permute                  permute_661              1 1 828 829 0=1
Convolution1D            conv1d_144               1 1 829 830 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_8                    1 1 830 831 0=0
Concat                   cat_22                   2 1 771 831 832 0=1
Split                    splitncnn_130            1 2 832 833 834
ConvolutionDepthWise1D   convdw1d_904             1 1 834 835 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_131            1 2 835 836 837
BinaryOp                 sub_118                  1 1 836 838 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_54               1 1 838 839
BinaryOp                 mul_119                  2 1 837 839 840 0=2
Convolution1D            conv1d_145               1 1 840 841 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_662              1 1 841 842 0=1
BinaryOp                 add_120                  2 1 827 842 843 0=0
Split                    splitncnn_132            1 2 843 844 845
InnerProduct             linear_243               1 1 845 846 0=1024 1=1 2=393216
Split                    splitncnn_133            1 2 846 847 848
BinaryOp                 sub_121                  1 1 847 849 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_55               1 1 849 850
BinaryOp                 mul_122                  2 1 848 850 851 0=2
InnerProduct             linear_244               1 1 851 852 0=384 1=1 2=393216
BinaryOp                 add_123                  2 1 844 852 853 0=0
Split                    splitncnn_134            1 2 853 854 855
Crop                     select_24                1 1 86 856 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_245               1 1 855 857 0=96 1=0 2=36864
Concat                   cat_23                   2 1 856 857 858 0=0
Split                    splitncnn_135            1 2 858 859 860
Reshape                  reshape_399              1 1 859 861 0=12 1=8 2=40
Permute                  permute_767              1 1 861 862 0=2
MatMul                   bmm_577                  2 1 819 862 863
Permute                  permute_768              1 1 863 864 0=2
Reshape                  reshape_400              1 1 864 865 0=96 1=8
InnerProduct             linear_246               1 1 865 866 0=384 1=1 2=36864
BinaryOp                 add_124                  2 1 854 866 867 0=0
Split                    splitncnn_136            1 2 867 868 869
Permute                  permute_663              1 1 869 870 0=1
Convolution1D            conv1d_146               1 1 870 871 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_9                    1 1 871 872 0=0
Concat                   cat_24                   2 1 773 872 873 0=1
Split                    splitncnn_137            1 2 873 874 875
ConvolutionDepthWise1D   convdw1d_905             1 1 875 876 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_138            1 2 876 877 878
BinaryOp                 sub_125                  1 1 877 879 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_56               1 1 879 880
BinaryOp                 mul_126                  2 1 878 880 881 0=2
Convolution1D            conv1d_147               1 1 881 882 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_664              1 1 882 883 0=1
BinaryOp                 add_127                  2 1 868 883 884 0=0
Split                    splitncnn_139            1 2 884 885 886
InnerProduct             linear_247               1 1 886 887 0=1024 1=1 2=393216
Split                    splitncnn_140            1 2 887 888 889
BinaryOp                 sub_128                  1 1 888 890 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_57               1 1 890 891
BinaryOp                 mul_129                  2 1 889 891 892 0=2
InnerProduct             linear_248               1 1 892 893 0=384 1=1 2=393216
