7767517
1794 2232
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Split                    splitncnn_0              1 2 in2 3 4
Input                    in3                      0 1 in3
Split                    splitncnn_1              1 4 in3 6 7 8 9
Input                    in4                      0 1 in4
Split                    splitncnn_2              1 3 in4 11 12 13
Input                    in5                      0 1 in5
Split                    splitncnn_3              1 2 in5 15 16
Input                    in6                      0 1 in6
Split                    splitncnn_4              1 4 in6 18 19 20 21
Input                    in7                      0 1 in7
Split                    splitncnn_5              1 2 in7 23 24
Input                    in8                      0 1 in8
Split                    splitncnn_6              1 4 in8 26 27 28 29
Input                    in9                      0 1 in9
Split                    splitncnn_7              1 3 in9 31 32 33
Input                    in10                     0 1 in10
Split                    splitncnn_8              1 2 in10 35 36
Input                    in11                     0 1 in11
Split                    splitncnn_9              1 4 in11 38 39 40 41
Input                    in12                     0 1 in12
Split                    splitncnn_10             1 2 in12 43 44
Input                    in13                     0 1 in13
Split                    splitncnn_11             1 4 in13 46 47 48 49
Input                    in14                     0 1 in14
Split                    splitncnn_12             1 3 in14 51 52 53
Input                    in15                     0 1 in15
Split                    splitncnn_13             1 2 in15 55 56
Input                    in16                     0 1 in16
Split                    splitncnn_14             1 4 in16 58 59 60 61
Input                    in17                     0 1 in17
Split                    splitncnn_15             1 2 in17 63 64
Input                    in18                     0 1 in18
Split                    splitncnn_16             1 4 in18 66 67 68 69
Input                    in19                     0 1 in19
Split                    splitncnn_17             1 3 in19 71 72 73
Input                    in20                     0 1 in20
Split                    splitncnn_18             1 2 in20 75 76
Input                    in21                     0 1 in21
Split                    splitncnn_19             1 4 in21 78 79 80 81
Input                    in22                     0 1 in22
Split                    splitncnn_20             1 2 in22 83 84
Input                    in23                     0 1 in23
Split                    splitncnn_21             1 4 in23 86 87 88 89
Input                    in24                     0 1 in24
Split                    splitncnn_22             1 3 in24 91 92 93
Input                    in25                     0 1 in25
Split                    splitncnn_23             1 2 in25 95 96
Input                    in26                     0 1 in26
Split                    splitncnn_24             1 4 in26 98 99 100 101
Input                    in27                     0 1 in27
Split                    splitncnn_25             1 2 in27 103 104
Input                    in28                     0 1 in28
Split                    splitncnn_26             1 4 in28 106 107 108 109
Input                    in29                     0 1 in29
Split                    splitncnn_27             1 3 in29 111 112 113
Input                    in30                     0 1 in30
Split                    splitncnn_28             1 2 in30 115 116
Input                    in31                     0 1 in31
Split                    splitncnn_29             1 4 in31 118 119 120 121
Input                    in32                     0 1 in32
Split                    splitncnn_30             1 2 in32 123 124
Input                    in33                     0 1 in33
Split                    splitncnn_31             1 4 in33 126 127 128 129
Input                    in34                     0 1 in34
Split                    splitncnn_32             1 3 in34 131 132 133
Input                    in35                     0 1 in35
Split                    splitncnn_33             1 2 in35 135 136
Input                    in36                     0 1 in36
Split                    splitncnn_34             1 4 in36 138 139 140 141
MemoryData               encoder.encoders.4.encoder.layers.3 0 1 142 0=1
MemoryData               encoder.encoders.4.encoder.layers.2 0 1 143 0=1
MemoryData               encoder.encoders.4.encoder.layers.1 0 1 144 0=1
MemoryData               encoder.encoders.4.encoder.layers.0 0 1 145 0=1
MemoryData               encoder.encoders.4.encoder.encoder_pos 0 1 146 0=384 1=47 2=1
MemoryData               encoder.encoders.3.encoder.layers.1 0 1 147 0=1
MemoryData               encoder.encoders.3.encoder.layers.0 0 1 148 0=1
MemoryData               encoder.encoders.3.encoder.encoder_pos 0 1 149 0=384 1=11 2=1
MemoryData               encoder.encoders.2.encoder.layers.2 0 1 150 0=1
MemoryData               encoder.encoders.2.encoder.layers.1 0 1 151 0=1
MemoryData               encoder.encoders.2.encoder.layers.0 0 1 152 0=1
MemoryData               encoder.encoders.2.encoder.encoder_pos 0 1 153 0=384 1=23 2=1
MemoryData               encoder.encoders.1.encoder.layers.3 0 1 154 0=1
MemoryData               encoder.encoders.1.encoder.layers.2 0 1 155 0=1
MemoryData               encoder.encoders.1.encoder.layers.1 0 1 156 0=1
MemoryData               encoder.encoders.1.encoder.layers.0 0 1 157 0=1
MemoryData               encoder.encoders.1.encoder.encoder_pos 0 1 158 0=384 1=47 2=1
MemoryData               encoder.encoders.0.layers.1 0 1 159 0=1
MemoryData               encoder.encoders.0.layers.0 0 1 160 0=1
MemoryData               encoder.encoders.0.encoder_pos 0 1 161 0=384 1=95 2=1
ExpandDims               unsqueeze_636            1 1 in0 162 -23303=1,0
Convolution              conv_187                 1 1 162 163 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_35             1 2 163 164 165
BinaryOp                 sub_0                    1 1 164 166 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 166 167
BinaryOp                 mul_1                    2 1 165 167 168 0=2
Convolution              conv_188                 1 1 168 169 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_36             1 2 169 170 171
BinaryOp                 sub_2                    1 1 170 172 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 172 173
BinaryOp                 mul_3                    2 1 171 173 174 0=2
Convolution              conv_189                 1 1 174 175 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_37             1 2 175 176 177
BinaryOp                 sub_4                    1 1 176 178 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 178 179
BinaryOp                 mul_5                    2 1 177 179 180 0=2
BinaryOp                 sub_6                    1 1 in1 181 0=1 1=1 2=7.000000e+00
BinaryOp                 div_7                    1 1 181 182 0=3 1=1 2=2.000000e+00
UnaryOp                  floor_8                  1 1 182 out1 0=2
Crop                     crop_762                 1 1 104 184 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.0.state_select_list.0_ncnnreshape0 1 1 184 185 0=0 1=0
Crop                     crop_763                 1 1 124 186 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_15_ncnnreshape0 1 1 186 187 0=0 1=0
Permute                  permute_566              1 1 180 188 0=2
Reshape                  reshape_361              1 1 188 189 0=2432 1=-1
InnerProduct             linear_190               1 1 189 190 0=384 1=1 2=933888
Split                    splitncnn_38             1 4 190 191 192 193 194
InnerProduct             linear_191               1 1 194 195 0=1024 1=1 2=393216
Split                    splitncnn_39             1 2 195 196 197
BinaryOp                 sub_9                    1 1 196 198 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 198 199
BinaryOp                 mul_10                   2 1 197 199 200 0=2
InnerProduct             linear_192               1 1 200 201 0=384 1=1 2=393216
BinaryOp                 add_11                   2 1 191 201 202 0=0
Split                    splitncnn_40             1 2 202 203 204
Crop                     select_0                 1 1 24 205 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_1                 1 1 4 206 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_637 3 3 204 206 205 207 208 209
InnerProduct             linear_193               1 1 207 210 0=384 1=0 2=147456
BinaryOp                 add_12                   2 1 203 210 211 0=0
Split                    splitncnn_41             1 2 211 212 213
Crop                     select_2                 1 1 44 214 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_3                 1 1 64 215 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_194               1 1 213 216 0=512 1=1 2=196608
Slice                    tensor_split_0           1 4 216 217 218 219 220 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 215 219 221 0=0
Reshape                  reshape_362              1 1 221 222 0=12 1=8 2=80
Reshape                  reshape_363              1 1 217 223 0=24 1=8 2=16
Reshape                  reshape_364              1 1 220 224 0=4 1=8 2=16
Concat                   cat_1                    2 1 214 218 225 0=0
Reshape                  reshape_365              1 1 225 226 0=24 1=8 2=80
InnerProduct             linear_195               1 1 161 227 0=32 1=0 2=12288
Reshape                  reshape_366              1 1 227 228 0=4 1=8 2=95
Permute                  permute_656              1 1 228 229 0=3
Split                    splitncnn_42             1 2 229 230 231
Permute                  permute_654              1 1 224 232 0=2
MatMul                   matmul_521               2 1 232 231 233
Permute                  permute_655              1 1 226 234 0=3
Permute                  permute_653              1 1 223 235 0=2
MatMul                   matmul_522               2 1 235 234 236
TensorAsStrided          tensor_as_strided_792    1 1 233 237 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_13                   2 1 236 237 238 0=0
Reshape                  view_476                 1 1 238 239 0=80 1=16 2=8
Softmax                  softmax_108              1 1 239 240 0=-1 1=1
Split                    splitncnn_43             1 2 240 241 242
Permute                  permute_652              1 1 222 243 0=2
MatMul                   bmm_491                  2 1 242 243 244
Permute                  permute_657              1 1 244 245 0=2
Reshape                  reshape_367              1 1 245 246 0=96 1=16
InnerProduct             linear_196               1 1 246 247 0=384 1=1 2=36864
BinaryOp                 add_14                   2 1 212 247 248 0=0
Split                    splitncnn_44             1 2 248 249 250
Permute                  permute_568              1 1 250 251 0=1
Convolution1D            conv1d_127               1 1 251 252 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_0                    1 1 252 253 0=0
Concat                   cat_2                    2 1 185 253 254 0=1
ConvolutionDepthWise1D   convdw1d_815             1 1 254 255 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_45             1 2 255 256 257
BinaryOp                 sub_15                   1 1 256 258 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 258 259
BinaryOp                 mul_16                   2 1 257 259 260 0=2
Convolution1D            conv1d_128               1 1 260 261 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_569              1 1 261 262 0=1
BinaryOp                 add_17                   2 1 249 262 263 0=0
Split                    splitncnn_46             1 2 263 264 265
InnerProduct             linear_197               1 1 265 266 0=1024 1=1 2=393216
Split                    splitncnn_47             1 2 266 267 268
BinaryOp                 sub_18                   1 1 267 269 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 269 270
BinaryOp                 mul_19                   2 1 268 270 271 0=2
InnerProduct             linear_198               1 1 271 272 0=384 1=1 2=393216
BinaryOp                 add_20                   2 1 264 272 273 0=0
Split                    splitncnn_48             1 2 273 274 275
Crop                     select_4                 1 1 84 276 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_199               1 1 275 277 0=96 1=0 2=36864
Concat                   cat_3                    2 1 276 277 278 0=0
Reshape                  reshape_368              1 1 278 279 0=12 1=8 2=80
Permute                  permute_658              1 1 279 280 0=2
MatMul                   bmm_492                  2 1 241 280 281
Permute                  permute_659              1 1 281 282 0=2
Reshape                  reshape_369              1 1 282 283 0=96 1=16
InnerProduct             linear_200               1 1 283 284 0=384 1=1 2=36864
BinaryOp                 add_21                   2 1 274 284 285 0=0
Split                    splitncnn_49             1 2 285 286 287
Permute                  permute_570              1 1 287 288 0=1
Convolution1D            conv1d_129               1 1 288 289 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_1                    1 1 289 290 0=0
Concat                   cat_4                    2 1 187 290 291 0=1
ConvolutionDepthWise1D   convdw1d_816             1 1 291 292 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_50             1 2 292 293 294
BinaryOp                 sub_22                   1 1 293 295 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 295 296
BinaryOp                 mul_23                   2 1 294 296 297 0=2
Convolution1D            conv1d_130               1 1 297 298 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_571              1 1 298 299 0=1
BinaryOp                 add_24                   2 1 286 299 300 0=0
Split                    splitncnn_51             1 2 300 301 302
InnerProduct             linear_201               1 1 302 303 0=1024 1=1 2=393216
Split                    splitncnn_52             1 2 303 304 305
BinaryOp                 sub_25                   1 1 304 306 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 306 307
BinaryOp                 mul_26                   2 1 305 307 308 0=2
InnerProduct             linear_202               1 1 308 309 0=384 1=1 2=393216
BinaryOp                 add_27                   2 1 301 309 310 0=0
Split                    splitncnn_53             1 3 310 311 312 313
BinaryOp                 mul_28                   2 1 311 312 314 0=2
Reduction                mean_551                 1 1 314 315 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_29                   1 1 315 316 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_30                   1 1 316 317 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_31                   2 1 313 317 318 0=2
BinaryOp                 sub_32                   2 1 318 192 319 0=1
BinaryOp                 mul_33                   2 1 319 160 320 0=2
BinaryOp                 add_34                   2 1 193 320 321 0=0
Split                    splitncnn_54             1 4 321 322 323 324 325
Crop                     crop_764                 1 1 103 326 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.0.state_select_list.1_ncnnreshape0 1 1 326 327 0=0 1=0
Crop                     crop_765                 1 1 123 328 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_22_ncnnreshape0 1 1 328 329 0=0 1=0
InnerProduct             linear_203               1 1 325 330 0=1024 1=1 2=393216
Split                    splitncnn_55             1 2 330 331 332
BinaryOp                 sub_35                   1 1 331 333 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 333 334
BinaryOp                 mul_36                   2 1 332 334 335 0=2
InnerProduct             linear_204               1 1 335 336 0=384 1=1 2=393216
BinaryOp                 add_37                   2 1 322 336 337 0=0
Split                    splitncnn_56             1 2 337 338 339
Crop                     select_5                 1 1 23 340 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_6                 1 1 3 341 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_638 3 3 339 341 340 342 343 344
InnerProduct             linear_205               1 1 342 345 0=384 1=0 2=147456
BinaryOp                 add_38                   2 1 338 345 346 0=0
Split                    splitncnn_57             1 2 346 347 348
Crop                     select_7                 1 1 43 349 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_8                 1 1 63 350 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_206               1 1 348 351 0=512 1=1 2=196608
Slice                    tensor_split_1           1 4 351 352 353 354 355 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 350 354 356 0=0
Reshape                  reshape_370              1 1 356 357 0=12 1=8 2=80
Reshape                  reshape_371              1 1 352 358 0=24 1=8 2=16
Reshape                  reshape_372              1 1 355 359 0=4 1=8 2=16
Concat                   cat_6                    2 1 349 353 360 0=0
Reshape                  reshape_373              1 1 360 361 0=24 1=8 2=80
Permute                  permute_662              1 1 359 362 0=2
MatMul                   matmul_523               2 1 362 230 363
Permute                  permute_663              1 1 361 364 0=3
Permute                  permute_661              1 1 358 365 0=2
MatMul                   matmul_524               2 1 365 364 366
TensorAsStrided          tensor_as_strided_793    1 1 363 367 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_39                   2 1 366 367 368 0=0
Reshape                  view_477                 1 1 368 369 0=80 1=16 2=8
Softmax                  softmax_109              1 1 369 370 0=-1 1=1
Split                    splitncnn_58             1 2 370 371 372
Permute                  permute_660              1 1 357 373 0=2
MatMul                   bmm_493                  2 1 372 373 374
Permute                  permute_664              1 1 374 375 0=2
Reshape                  reshape_374              1 1 375 376 0=96 1=16
InnerProduct             linear_207               1 1 376 377 0=384 1=1 2=36864
BinaryOp                 add_40                   2 1 347 377 378 0=0
Split                    splitncnn_59             1 2 378 379 380
Permute                  permute_572              1 1 380 381 0=1
Convolution1D            conv1d_131               1 1 381 382 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_2                    1 1 382 383 0=0
Concat                   cat_7                    2 1 327 383 384 0=1
ConvolutionDepthWise1D   convdw1d_817             1 1 384 385 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_60             1 2 385 386 387
BinaryOp                 sub_41                   1 1 386 388 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 388 389
BinaryOp                 mul_42                   2 1 387 389 390 0=2
Convolution1D            conv1d_132               1 1 390 391 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_573              1 1 391 392 0=1
BinaryOp                 add_43                   2 1 379 392 393 0=0
Split                    splitncnn_61             1 2 393 394 395
InnerProduct             linear_208               1 1 395 396 0=1024 1=1 2=393216
Split                    splitncnn_62             1 2 396 397 398
BinaryOp                 sub_44                   1 1 397 399 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 399 400
BinaryOp                 mul_45                   2 1 398 400 401 0=2
InnerProduct             linear_209               1 1 401 402 0=384 1=1 2=393216
BinaryOp                 add_46                   2 1 394 402 403 0=0
Split                    splitncnn_63             1 2 403 404 405
Crop                     select_9                 1 1 83 406 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_210               1 1 405 407 0=96 1=0 2=36864
Concat                   cat_8                    2 1 406 407 408 0=0
Reshape                  reshape_375              1 1 408 409 0=12 1=8 2=80
Permute                  permute_665              1 1 409 410 0=2
MatMul                   bmm_494                  2 1 371 410 411
Permute                  permute_666              1 1 411 412 0=2
Reshape                  reshape_376              1 1 412 413 0=96 1=16
InnerProduct             linear_211               1 1 413 414 0=384 1=1 2=36864
BinaryOp                 add_47                   2 1 404 414 415 0=0
Split                    splitncnn_64             1 2 415 416 417
Permute                  permute_574              1 1 417 418 0=1
Convolution1D            conv1d_133               1 1 418 419 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_3                    1 1 419 420 0=0
Concat                   cat_9                    2 1 329 420 421 0=1
ConvolutionDepthWise1D   convdw1d_818             1 1 421 422 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_65             1 2 422 423 424
BinaryOp                 sub_48                   1 1 423 425 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 425 426
BinaryOp                 mul_49                   2 1 424 426 427 0=2
Convolution1D            conv1d_134               1 1 427 428 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_575              1 1 428 429 0=1
BinaryOp                 add_50                   2 1 416 429 430 0=0
Split                    splitncnn_66             1 2 430 431 432
InnerProduct             linear_212               1 1 432 433 0=1024 1=1 2=393216
Split                    splitncnn_67             1 2 433 434 435
BinaryOp                 sub_51                   1 1 434 436 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 436 437
BinaryOp                 mul_52                   2 1 435 437 438 0=2
InnerProduct             linear_213               1 1 438 439 0=384 1=1 2=393216
BinaryOp                 add_53                   2 1 431 439 440 0=0
Split                    splitncnn_68             1 3 440 441 442 443
BinaryOp                 mul_54                   2 1 441 442 444 0=2
Reduction                mean_552                 1 1 444 445 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_55                   1 1 445 446 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_56                   1 1 446 447 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_57                   2 1 443 447 448 0=2
BinaryOp                 sub_58                   2 1 448 323 449 0=1
BinaryOp                 mul_59                   2 1 449 159 450 0=2
BinaryOp                 add_60                   2 1 324 450 451 0=0
Split                    splitncnn_69             1 2 451 452 453
MemoryData               encoder.encoders.1.downsample 0 1 454 0=384 1=1
Reshape                  reshape_377              1 1 453 455 0=384 1=2 2=8
Split                    splitncnn_70             1 2 455 456 457
BinaryOp                 mul_61                   2 1 456 454 458 0=2
Reduction                sum_628                  1 1 458 459 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_110              1 1 459 460
BinaryOp                 mul_62                   2 1 457 460 461 0=2
Reduction                sum_629                  1 1 461 462 0=0 1=0 -23303=0 4=0 5=1
Crop                     crop_766                 1 1 109 463 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoder.encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 463 464 0=0 1=0
Crop                     crop_767                 1 1 129 465 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_30_ncnnreshape0 1 1 465 466 0=0 1=0
Split                    splitncnn_71             1 4 462 467 468 469 470
InnerProduct             linear_214               1 1 470 471 0=1024 1=1 2=393216
Split                    splitncnn_72             1 2 471 472 473
BinaryOp                 sub_63                   1 1 472 474 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 474 475
BinaryOp                 mul_64                   2 1 473 475 476 0=2
InnerProduct             linear_215               1 1 476 477 0=384 1=1 2=393216
BinaryOp                 add_65                   2 1 467 477 478 0=0
Split                    splitncnn_73             1 2 478 479 480
Crop                     select_10                1 1 29 481 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_11                1 1 9 482 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_639 3 3 480 482 481 483 484 485
InnerProduct             linear_216               1 1 483 486 0=384 1=0 2=147456
BinaryOp                 add_66                   2 1 479 486 487 0=0
Split                    splitncnn_74             1 2 487 488 489
Crop                     select_12                1 1 49 490 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_13                1 1 69 491 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_217               1 1 489 492 0=512 1=1 2=196608
Slice                    tensor_split_2           1 4 492 493 494 495 496 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 491 495 497 0=0
Reshape                  reshape_378              1 1 497 498 0=12 1=8 2=40
Reshape                  reshape_379              1 1 493 499 0=24 1=8 2=8
Reshape                  reshape_380              1 1 496 500 0=4 1=8 2=8
Concat                   cat_11                   2 1 490 494 501 0=0
Reshape                  reshape_381              1 1 501 502 0=24 1=8 2=40
InnerProduct             linear_218               1 1 158 503 0=32 1=0 2=12288
Reshape                  reshape_382              1 1 503 504 0=4 1=8 2=47
Permute                  permute_671              1 1 504 505 0=3
Split                    splitncnn_75             1 4 505 506 507 508 509
Permute                  permute_669              1 1 500 510 0=2
MatMul                   matmul_525               2 1 510 509 511
Permute                  permute_670              1 1 502 512 0=3
Permute                  permute_668              1 1 499 513 0=2
MatMul                   matmul_526               2 1 513 512 514
TensorAsStrided          tensor_as_strided_794    1 1 511 515 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_67                   2 1 514 515 516 0=0
Reshape                  view_478                 1 1 516 517 0=40 1=8 2=8
Softmax                  softmax_111              1 1 517 518 0=-1 1=1
Split                    splitncnn_76             1 2 518 519 520
Permute                  permute_667              1 1 498 521 0=2
MatMul                   bmm_495                  2 1 520 521 522
Permute                  permute_672              1 1 522 523 0=2
Reshape                  reshape_383              1 1 523 524 0=96 1=8
InnerProduct             linear_219               1 1 524 525 0=384 1=1 2=36864
BinaryOp                 add_68                   2 1 488 525 526 0=0
Split                    splitncnn_77             1 2 526 527 528
Permute                  permute_576              1 1 528 529 0=1
Convolution1D            conv1d_135               1 1 529 530 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_4                    1 1 530 531 0=0
Concat                   cat_12                   2 1 464 531 532 0=1
ConvolutionDepthWise1D   convdw1d_819             1 1 532 533 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_78             1 2 533 534 535
BinaryOp                 sub_69                   1 1 534 536 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 536 537
BinaryOp                 mul_70                   2 1 535 537 538 0=2
Convolution1D            conv1d_136               1 1 538 539 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_577              1 1 539 540 0=1
BinaryOp                 add_71                   2 1 527 540 541 0=0
Split                    splitncnn_79             1 2 541 542 543
InnerProduct             linear_220               1 1 543 544 0=1024 1=1 2=393216
Split                    splitncnn_80             1 2 544 545 546
BinaryOp                 sub_72                   1 1 545 547 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 547 548
BinaryOp                 mul_73                   2 1 546 548 549 0=2
InnerProduct             linear_221               1 1 549 550 0=384 1=1 2=393216
BinaryOp                 add_74                   2 1 542 550 551 0=0
Split                    splitncnn_81             1 2 551 552 553
Crop                     select_14                1 1 89 554 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_222               1 1 553 555 0=96 1=0 2=36864
Concat                   cat_13                   2 1 554 555 556 0=0
Reshape                  reshape_384              1 1 556 557 0=12 1=8 2=40
Permute                  permute_673              1 1 557 558 0=2
MatMul                   bmm_496                  2 1 519 558 559
Permute                  permute_674              1 1 559 560 0=2
Reshape                  reshape_385              1 1 560 561 0=96 1=8
InnerProduct             linear_223               1 1 561 562 0=384 1=1 2=36864
BinaryOp                 add_75                   2 1 552 562 563 0=0
Split                    splitncnn_82             1 2 563 564 565
Permute                  permute_578              1 1 565 566 0=1
Convolution1D            conv1d_137               1 1 566 567 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_5                    1 1 567 568 0=0
Concat                   cat_14                   2 1 466 568 569 0=1
ConvolutionDepthWise1D   convdw1d_820             1 1 569 570 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_83             1 2 570 571 572
BinaryOp                 sub_76                   1 1 571 573 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_46               1 1 573 574
BinaryOp                 mul_77                   2 1 572 574 575 0=2
Convolution1D            conv1d_138               1 1 575 576 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_579              1 1 576 577 0=1
BinaryOp                 add_78                   2 1 564 577 578 0=0
Split                    splitncnn_84             1 2 578 579 580
InnerProduct             linear_224               1 1 580 581 0=1024 1=1 2=393216
Split                    splitncnn_85             1 2 581 582 583
BinaryOp                 sub_79                   1 1 582 584 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_47               1 1 584 585
BinaryOp                 mul_80                   2 1 583 585 586 0=2
InnerProduct             linear_225               1 1 586 587 0=384 1=1 2=393216
BinaryOp                 add_81                   2 1 579 587 588 0=0
Split                    splitncnn_86             1 3 588 589 590 591
BinaryOp                 mul_82                   2 1 589 590 592 0=2
Reduction                mean_553                 1 1 592 593 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_83                   1 1 593 594 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_84                   1 1 594 595 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_85                   2 1 591 595 596 0=2
BinaryOp                 sub_86                   2 1 596 468 597 0=1
BinaryOp                 mul_87                   2 1 597 157 598 0=2
BinaryOp                 add_88                   2 1 469 598 599 0=0
Split                    splitncnn_87             1 4 599 600 601 602 603
Crop                     crop_768                 1 1 108 604 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoder.encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 604 605 0=0 1=0
Crop                     crop_769                 1 1 128 606 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_38_ncnnreshape0 1 1 606 607 0=0 1=0
InnerProduct             linear_226               1 1 603 608 0=1024 1=1 2=393216
Split                    splitncnn_88             1 2 608 609 610
BinaryOp                 sub_89                   1 1 609 611 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_48               1 1 611 612
BinaryOp                 mul_90                   2 1 610 612 613 0=2
InnerProduct             linear_227               1 1 613 614 0=384 1=1 2=393216
BinaryOp                 add_91                   2 1 600 614 615 0=0
Split                    splitncnn_89             1 2 615 616 617
Crop                     select_15                1 1 28 618 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_16                1 1 8 619 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_640 3 3 617 619 618 620 621 622
InnerProduct             linear_228               1 1 620 623 0=384 1=0 2=147456
BinaryOp                 add_92                   2 1 616 623 624 0=0
Split                    splitncnn_90             1 2 624 625 626
Crop                     select_17                1 1 48 627 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_18                1 1 68 628 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_229               1 1 626 629 0=512 1=1 2=196608
Slice                    tensor_split_3           1 4 629 630 631 632 633 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 628 632 634 0=0
Reshape                  reshape_386              1 1 634 635 0=12 1=8 2=40
Reshape                  reshape_387              1 1 630 636 0=24 1=8 2=8
Reshape                  reshape_388              1 1 633 637 0=4 1=8 2=8
Concat                   cat_16                   2 1 627 631 638 0=0
Reshape                  reshape_389              1 1 638 639 0=24 1=8 2=40
Permute                  permute_677              1 1 637 640 0=2
MatMul                   matmul_527               2 1 640 508 641
Permute                  permute_678              1 1 639 642 0=3
Permute                  permute_676              1 1 636 643 0=2
MatMul                   matmul_528               2 1 643 642 644
TensorAsStrided          tensor_as_strided_795    1 1 641 645 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_93                   2 1 644 645 646 0=0
Reshape                  view_479                 1 1 646 647 0=40 1=8 2=8
Softmax                  softmax_112              1 1 647 648 0=-1 1=1
Split                    splitncnn_91             1 2 648 649 650
Permute                  permute_675              1 1 635 651 0=2
MatMul                   bmm_497                  2 1 650 651 652
Permute                  permute_679              1 1 652 653 0=2
Reshape                  reshape_390              1 1 653 654 0=96 1=8
InnerProduct             linear_230               1 1 654 655 0=384 1=1 2=36864
BinaryOp                 add_94                   2 1 625 655 656 0=0
Split                    splitncnn_92             1 2 656 657 658
Permute                  permute_580              1 1 658 659 0=1
Convolution1D            conv1d_139               1 1 659 660 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_6                    1 1 660 661 0=0
Concat                   cat_17                   2 1 605 661 662 0=1
ConvolutionDepthWise1D   convdw1d_821             1 1 662 663 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_93             1 2 663 664 665
BinaryOp                 sub_95                   1 1 664 666 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_49               1 1 666 667
BinaryOp                 mul_96                   2 1 665 667 668 0=2
Convolution1D            conv1d_140               1 1 668 669 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_581              1 1 669 670 0=1
BinaryOp                 add_97                   2 1 657 670 671 0=0
Split                    splitncnn_94             1 2 671 672 673
InnerProduct             linear_231               1 1 673 674 0=1024 1=1 2=393216
Split                    splitncnn_95             1 2 674 675 676
BinaryOp                 sub_98                   1 1 675 677 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_50               1 1 677 678
BinaryOp                 mul_99                   2 1 676 678 679 0=2
InnerProduct             linear_232               1 1 679 680 0=384 1=1 2=393216
BinaryOp                 add_100                  2 1 672 680 681 0=0
Split                    splitncnn_96             1 2 681 682 683
Crop                     select_19                1 1 88 684 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_233               1 1 683 685 0=96 1=0 2=36864
Concat                   cat_18                   2 1 684 685 686 0=0
Reshape                  reshape_391              1 1 686 687 0=12 1=8 2=40
Permute                  permute_680              1 1 687 688 0=2
MatMul                   bmm_498                  2 1 649 688 689
Permute                  permute_681              1 1 689 690 0=2
Reshape                  reshape_392              1 1 690 691 0=96 1=8
InnerProduct             linear_234               1 1 691 692 0=384 1=1 2=36864
BinaryOp                 add_101                  2 1 682 692 693 0=0
Split                    splitncnn_97             1 2 693 694 695
Permute                  permute_582              1 1 695 696 0=1
Convolution1D            conv1d_141               1 1 696 697 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_7                    1 1 697 698 0=0
Concat                   cat_19                   2 1 607 698 699 0=1
ConvolutionDepthWise1D   convdw1d_822             1 1 699 700 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_98             1 2 700 701 702
BinaryOp                 sub_102                  1 1 701 703 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_51               1 1 703 704
BinaryOp                 mul_103                  2 1 702 704 705 0=2
Convolution1D            conv1d_142               1 1 705 706 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_583              1 1 706 707 0=1
BinaryOp                 add_104                  2 1 694 707 708 0=0
Split                    splitncnn_99             1 2 708 709 710
InnerProduct             linear_235               1 1 710 711 0=1024 1=1 2=393216
Split                    splitncnn_100            1 2 711 712 713
BinaryOp                 sub_105                  1 1 712 714 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_52               1 1 714 715
BinaryOp                 mul_106                  2 1 713 715 716 0=2
InnerProduct             linear_236               1 1 716 717 0=384 1=1 2=393216
BinaryOp                 add_107                  2 1 709 717 718 0=0
Split                    splitncnn_101            1 3 718 719 720 721
BinaryOp                 mul_108                  2 1 719 720 722 0=2
Reduction                mean_554                 1 1 722 723 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_109                  1 1 723 724 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_110                  1 1 724 725 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_111                  2 1 721 725 726 0=2
BinaryOp                 sub_112                  2 1 726 601 727 0=1
BinaryOp                 mul_113                  2 1 727 156 728 0=2
BinaryOp                 add_114                  2 1 602 728 729 0=0
Split                    splitncnn_102            1 4 729 730 731 732 733
Crop                     crop_770                 1 1 107 734 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  encoder.encoders.1.encoder.state_select_list.2_ncnnreshape0 1 1 734 735 0=0 1=0
Crop                     crop_771                 1 1 127 736 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_46_ncnnreshape0 1 1 736 737 0=0 1=0
InnerProduct             linear_237               1 1 733 738 0=1024 1=1 2=393216
Split                    splitncnn_103            1 2 738 739 740
BinaryOp                 sub_115                  1 1 739 741 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_53               1 1 741 742
BinaryOp                 mul_116                  2 1 740 742 743 0=2
InnerProduct             linear_238               1 1 743 744 0=384 1=1 2=393216
BinaryOp                 add_117                  2 1 730 744 745 0=0
Split                    splitncnn_104            1 2 745 746 747
Crop                     select_20                1 1 27 748 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_21                1 1 7 749 -23310=1,3 -23311=1,0 -23309=1,2
PoolingModuleNoProj      pooling_modul_no_proj_641 3 3 747 749 748 750 751 752
InnerProduct             linear_239               1 1 750 753 0=384 1=0 2=147456
BinaryOp                 add_118                  2 1 746 753 754 0=0
Split                    splitncnn_105            1 2 754 755 756
Crop                     select_22                1 1 47 757 -23310=1,3 -23311=1,0 -23309=1,2
Crop                     select_23                1 1 67 758 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_240               1 1 756 759 0=512 1=1 2=196608
Slice                    tensor_split_4           1 4 759 760 761 762 763 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 758 762 764 0=0
Reshape                  reshape_393              1 1 764 765 0=12 1=8 2=40
Reshape                  reshape_394              1 1 760 766 0=24 1=8 2=8
Reshape                  reshape_395              1 1 763 767 0=4 1=8 2=8
Concat                   cat_21                   2 1 757 761 768 0=0
Reshape                  reshape_396              1 1 768 769 0=24 1=8 2=40
Permute                  permute_684              1 1 767 770 0=2
MatMul                   matmul_529               2 1 770 507 771
Permute                  permute_685              1 1 769 772 0=3
Permute                  permute_683              1 1 766 773 0=2
MatMul                   matmul_530               2 1 773 772 774
TensorAsStrided          tensor_as_strided_796    1 1 771 775 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_119                  2 1 774 775 776 0=0
Reshape                  view_480                 1 1 776 777 0=40 1=8 2=8
Softmax                  softmax_113              1 1 777 778 0=-1 1=1
Split                    splitncnn_106            1 2 778 779 780
Permute                  permute_682              1 1 765 781 0=2
MatMul                   bmm_499                  2 1 780 781 782
Permute                  permute_686              1 1 782 783 0=2
Reshape                  reshape_397              1 1 783 784 0=96 1=8
InnerProduct             linear_241               1 1 784 785 0=384 1=1 2=36864
BinaryOp                 add_120                  2 1 755 785 786 0=0
Split                    splitncnn_107            1 2 786 787 788
Permute                  permute_584              1 1 788 789 0=1
Convolution1D            conv1d_143               1 1 789 790 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_8                    1 1 790 791 0=0
Concat                   cat_22                   2 1 735 791 792 0=1
ConvolutionDepthWise1D   convdw1d_823             1 1 792 793 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_108            1 2 793 794 795
BinaryOp                 sub_121                  1 1 794 796 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_54               1 1 796 797
BinaryOp                 mul_122                  2 1 795 797 798 0=2
Convolution1D            conv1d_144               1 1 798 799 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_585              1 1 799 800 0=1
BinaryOp                 add_123                  2 1 787 800 801 0=0
Split                    splitncnn_109            1 2 801 802 803
InnerProduct             linear_242               1 1 803 804 0=1024 1=1 2=393216
Split                    splitncnn_110            1 2 804 805 806
BinaryOp                 sub_124                  1 1 805 807 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_55               1 1 807 808
BinaryOp                 mul_125                  2 1 806 808 809 0=2
InnerProduct             linear_243               1 1 809 810 0=384 1=1 2=393216
BinaryOp                 add_126                  2 1 802 810 811 0=0
Split                    splitncnn_111            1 2 811 812 813
Crop                     select_24                1 1 87 814 -23310=1,3 -23311=1,0 -23309=1,2
InnerProduct             linear_244               1 1 813 815 0=96 1=0 2=36864
Concat                   cat_23                   2 1 814 815 816 0=0
Reshape                  reshape_398              1 1 816 817 0=12 1=8 2=40
Permute                  permute_687              1 1 817 818 0=2
MatMul                   bmm_500                  2 1 779 818 819
Permute                  permute_688              1 1 819 820 0=2
Reshape                  reshape_399              1 1 820 821 0=96 1=8
InnerProduct             linear_245               1 1 821 822 0=384 1=1 2=36864
BinaryOp                 add_127                  2 1 812 822 823 0=0
Split                    splitncnn_112            1 2 823 824 825
Permute                  permute_586              1 1 825 826 0=1
Convolution1D            conv1d_145               1 1 826 827 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_9                    1 1 827 828 0=0
Concat                   cat_24                   2 1 737 828 829 0=1
ConvolutionDepthWise1D   convdw1d_824             1 1 829 830 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_113            1 2 830 831 832
BinaryOp                 sub_128                  1 1 831 833 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_56               1 1 833 834
BinaryOp                 mul_129                  2 1 832 834 835 0=2
Convolution1D            conv1d_146               1 1 835 836 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_587              1 1 836 837 0=1
BinaryOp                 add_130                  2 1 824 837 838 0=0
Split                    splitncnn_114            1 2 838 839 840
InnerProduct             linear_246               1 1 840 841 0=1024 1=1 2=393216
Split                    splitncnn_115            1 2 841 842 843
BinaryOp                 sub_131                  1 1 842 844 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_57               1 1 844 845
BinaryOp                 mul_132                  2 1 843 845 846 0=2
InnerProduct             linear_247               1 1 846 847 0=384 1=1 2=393216
BinaryOp                 add_133                  2 1 839 847 848 0=0
Split                    splitncnn_116            1 3 848 849 850 851
BinaryOp                 mul_134                  2 1 849 850 852 0=2
Reduction                mean_555                 1 1 852 853 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_135                  1 1 853 854 0=0 1=1 2=2.500000e-01
BinaryOp                 pow_136                  1 1 854 855 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_137                  2 1 851 855 856 0=2
BinaryOp                 sub_138                  2 1 856 731 857 0=1
BinaryOp                 mul_139                  2 1 857 155 858 0=2
BinaryOp                 add_140                  2 1 732 858 859 0=0
Split                    splitncnn_117            1 4 859 860 861 862 863
Crop                     crop_772                 1 1 106 864 -23310=1,4 -23311=1,0 -23309=1,3
Reshape                  encoder.encoders.1.encoder.state_select_list.3_ncnnreshape0 1 1 864 865 0=0 1=0
Crop                     crop_773                 1 1 126 866 -23310=1,4 -23311=1,0 -23309=1,3
Reshape                  pnnx_unique_54_ncnnreshape0 1 1 866 867 0=0 1=0
InnerProduct             linear_248               1 1 863 868 0=1024 1=1 2=393216
Split                    splitncnn_118            1 2 868 869 870
